[
  {
    "name": "Honours Bachelor of Aviation Technology",
    "campus": "Newnham, Peterborough",
    "email": "admissions@senecacollege.ca",
    "tuition": "$18,181",
    "url": "https://www.senecacollege.ca/programs/fulltime/FPR.html#-content_menu",
    "duration": "8 Semesters (4 Years)",
    "phone": "(416)-493-4144",
    "description": "This four-year program is the only aviation technology-based degree program in Canada. Seneca has been the national leader in aviation education for more than 40 years. Responding to emerging industry demands, Seneca is now educating students at the degree level. Our program provides a rigorous aviation technology-based curriculum developing your theoretical and practical knowledge of aviation technology. You will gain the knowledge and experience to safely operate complex aircraft.  You will also learn business management, airport operations and planning and air carrier administration to gain a larger sense of the variety of careers in the aviation industry.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD) or equivalent, including six Grade 12 U or M  courses with a minimum overall average of 65%, or a mature applicant (21 years or older). Required courses with minimum final grade of 65% in each and minimum four-course average of 70%: English: Grade 12 ENG4U Calculus and Vectors: Grade 12 MCV4U Advanced Functions: Grade 12 MHF4U Physics: Grade 12 SPH4U",
    "keywords": {
      "Bachelor": true,
      "Aviation": true
    }
  },
  {
    "name": "Airline Pilot Flight Operations",
    "campus": "Peterborough",
    "email": "admissions@senecacollege.ca",
    "tuition": "$12,139",
    "url": "https://www.senecacollege.ca/programs/fulltime/APF.html",
    "duration": "2 Semesters (8 Months)",
    "phone": "(416)-493-4144",
    "description": "Seneca is a national leader in aviation education with more than 50 years of experience in practical flight training and education. This eight-month graduate certificate program is the only program in Canada that is positioned to meet the future requirements of the aerospace industry. In this program, you will receive more than 100 hours of Canadian Air Carrier Operations training and education.",
    "requiredIelts": {},
    "requirements": "Ontario university or college degree or college diploma or equivalent. Applicants with an equivalent combination of partial postsecondary and/or three years of work experience may be considered for admission. A relevant resumé and references must be provided. Commercial Pilot License. Group 1 Instrument Rating. Flight simulation evaluation and written exam. English proficiency for graduate certificates. Canadian citizens or permanent residents educated outside of Canada must provide a World Education Services (WES) or ICAS Canada credential evaluation."
  },
  {
    "name": "Aviation Operations",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,690",
    "url": "https://www.senecacollege.ca/programs/fulltime/AVO.html#pre-content_menu",
    "duration": "4 Semesters (2 Years)",
    "phone": "(416)-493-4144",
    "description": "In this two-year diploma program, you will receive a comprehensive education in aviation that includes the study of Canadian regulations, as well as the technical and practical skills required to work in a variety of airside operations roles. The Aviation Operation diploma program will provide you with the information you need to complete the Transport Canada Dispatcher licence exams.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course. Mathematics: Grade 12 C or U, or equivalent course. Canadian citizens and permanent residents may satisfy the English and/or mathematics requirements for this program through successful Seneca pre-admission testing."
  },
  {
    "name": "Aviation Safety",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,690",
    "url": "https://www.senecacollege.ca/programs/fulltime/ASE.html",
    "duration": "6 Semesters (3 Years)",
    "phone": "(416)-493-4144",
    "description": "In this three-year advanced diploma program, you will receive a comprehensive education in a variety of essential safety techniques relevant to the aviation industry. You will learn Canadian aviation industry regulations, and business, leadership and technical skills required to implement policies and procedures to begin your career in a variety of aviation companies including commercial airlines, flight schools, insurance companies and airports.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD) or equivalent with: Grade 12 English: ENG4(C) or ENG4(U). Grade 12 Mathematics: (C) or (U) OR Mature Student Status (age 19 or older) with the above prerequisite course(s), their equivalent(s), or appropriate Academic and Career Entrance (ACE) Certificate program credits (see Academic Upgrading)."
  },
  {
    "name": "Commercial Pilot",
    "campus": "Toronto Airways Oshawa",
    "email": "admissions@senecacollege.ca",
    "tuition": "$7,000",
    "url": "https://www.senecacollege.ca/programs/fulltime/PIL.html",
    "duration": "2 Semesters (8 Months)",
    "phone": "(416)-493-4144",
    "description": "Amid the growing demand for pilots worldwide, this program will prepare you to take flight as a commercial pilot in the aviation industry. Your learning will be combined under Seneca’s School of Aviation and Toronto Airways who together have more than 90 years of experience in educating professional pilots. This program is based out of the Oshawa Executive Airport, where you will complete both your hands-on flight training and academic classes. In addition to pilot operations, your learning outcomes will include crew resource management, multi-crew co-operation and scenario-based training.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course. Mathematics: Grade 12 C or U, or Grade 11 U, or equivalent course"
  },
  {
    "name": "Accounting",
    "campus": "Newnham, Seneca Internation Academy",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,690",
    "url": "https://www.senecacollege.ca/programs/fulltime/ACC.html",
    "duration": "4 Semesters (2 Years)",
    "phone": "(416)-493-4144",
    "description": "This two-year diploma program in accounting will introduce you to the accounting practices, related technology applications, business fundamentals and the soft skills needed to find employment. You will learn how to use computer applications like Microsoft Excel spreadsheets and Access relational database management software. As a student of this program, assuming specific course grade and GPA requirements are met, and upon completion of five bridging courses, you will be eligible to directly enter Seneca’s Honours Bachelor of Commerce - International Accounting & Finance (IAF).",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course. Mathematics: Grade 12 C or U, or Grade 11 U or M, or equivalent course. Canadian citizens and permanent residents may satisfy the English and/or mathematics requirements for this program through successful Seneca pre-admission testing."
  },
  {
    "name": "Accounting Techniques",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,690",
    "url": "https://www.senecacollege.ca/programs/fulltime/ACT.html",
    "duration": "2 Semesters (8 Months)",
    "phone": "(416)-493-4144",
    "description": "This eight-month certificate program is designed to provide you with a solid background in accounting and computerized bookkeeping. The program focuses on helping you develop critical skills, such as financial reporting, practical experience with accounting software packages and training in business communication. Offered in cooperation with the Canadian Institute of Bookkeeping (CIB) this program allows you to earn courses required for CIB's professional bookkeeping designation and prepares you for a career in bookkeeping and entry-level accounting.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course. Mathematics: Grade 12 C or U, or Grade 11 U or M, or equivalent course"
  },
  {
    "name": "Accounting and Finance",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,690",
    "url": "https://www.senecacollege.ca/programs/fulltime/ACF.html",
    "duration": "6 Semesters (3 Years)",
    "phone": "(416)-493-4144",
    "description": "In this three-year advanced diploma program, you will develop in-depth technical knowledge of financial accounting, cost and managerial accounting, taxation, financial management, auditing and technology applications. ",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course. Mathematics: Grade 12 C or U, or Grade 11 U or M, or equivalent course. Canadian citizens and permanent residents may satisfy the English and/or mathematics requirements for this program through successful Seneca pre-admission testing."
  },
  {
    "name": "Accounting and Payroll",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,690",
    "url": "https://www.senecacollege.ca/programs/fulltime/APP.html",
    "duration": "4 Semesters (2 Years)",
    "phone": "(416)-493-4144",
    "description": "In this two-year diploma program, you will gain in-depth knowledge of accounting, payroll and human resource practices and related technology applications. You will benefit from hands-on learning through case studies based on actual work situations, and leading-edge accounting and payroll software. Guest speakers and simulated real-life projects will also add to your learning experience.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course. Mathematics: Grade 12 C or U, or Grade 11 U or M, or equivalent course"
  },
  {
    "name": "Advanced Accounting and Finance",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$6,822",
    "url": "https://www.senecacollege.ca/programs/fulltime/AAF.html",
    "duration": "2 Semesters (8 Months)",
    "phone": "(416)-493-4144",
    "description": "This eight-month graduate certificate program is for you if you are aspiring to a career in accounting and finance at an intermediate level. You will build on your previous accounting credential by expanding your skills in taxation, finance, management accounting, financial accounting and information systems.",
    "requiredIelts": {},
    "requirements": "Ontario university/college degree or college diploma or equivalent in accounting. Applicants must have completed the following prerequisite courses: Introductory Financial Accounting. Introductory Management Accounting. Intermediate Financial Accounting I and II. English proficiency for graduate certificates. Applicants educated outside of Canada must provide a World Education Services (WES) or ICAS Canada course-by-course (comprehensive) credential evaluation."
  },
  {
    "name": "Business - Insurance",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,690",
    "url": "https://www.senecacollege.ca/programs/fulltime/BIN.html",
    "duration": "4 Semesters (2 Years)",
    "phone": "(416)-493-4144",
    "description": "This two-year diploma program prepares you for a dynamic career in the property and casualty (general) insurance industry in Canada. Offered in cooperation with the Insurance Institute of Canada (IIC), this program is anchored on the fundamental aspects of both business and insurance and was designed with experts from several national insurance firms. Your learning will focus explicitly on brokerage, underwriting and claims. As a graduate, you will have had the opportunity to earn eight credits toward the internationally recognized Chartered Insurance Professional (CIP) designation.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course. Mathematics: Grade 12 C or U, or Grade 11 U or M, or equivalent course. Canadian citizens and permanent residents may satisfy the English and/or mathematics requirements for this program through successful Seneca pre-admission testing."
  },
  {
    "name": "Business Administration - Financial Planning",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,690",
    "url": "https://www.senecacollege.ca/programs/fulltime/BAF.html",
    "duration": "6 Semesters (3 Years)",
    "phone": "(416)-493-4144",
    "description": "This three-year advanced diploma program will develop your in-depth knowledge of personal and financial planning including personal taxation, estate planning, retirement planning, insurance, investment strategies and risk management. In this program you will also have the opportunity to write various professional certifications required to excel in the financial sector.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course. Mathematics: Grade 12 C or U, or Grade 11 U or M, or equivalent course. Canadian citizens and permanent residents may satisfy the English and/or mathematics requirements for this program through successful Seneca pre-admission testing."
  },
  {
    "name": "Financial Planning",
    "campus": "Newnham, Seneca International Academy",
    "email": "admissions@senecacollege.ca",
    "tuition": "$5,855",
    "url": "https://www.senecacollege.ca/programs/fulltime/FIP.html",
    "duration": "2 Semesters (8 Months)",
    "phone": "(416)-493-4144",
    "description": "Banks, credit unions, mutual fund and full service dealers, and insurers need financial experts. In this eight-month graduate certificate program, you will learn about financial products and services. You will also learn to provide advice and develop financial plans based on individual client needs, risk tolerance and other unique circumstances. Additionally, you will work towards earning licenses and designations required by the industry.",
    "requiredIelts": {},
    "requirements": "Ontario university or college degree or college diploma or equivalent. English proficiency for graduate certificates. Canadian citizens or permanent residents who were educated outside of Canada must provide a World Education Services (WES) or ICAS Canada credential evaluation."
  },
  {
    "name": "Financial Services - Client Services",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,690",
    "url": "https://www.senecacollege.ca/programs/fulltime/FSA.html",
    "duration": "4 Semesters (2 Years)",
    "phone": "(416)-493-4144",
    "description": "This two-year diploma program equips you to succeed in the growing front–line client service areas of Canada's banking, insurance and investment sectors. You will learn about fundamental business principles and practices as well as specialized courses in financial planning, contact centre operations, mortgage lending and mutual funds.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course. Mathematics: Grade 12 C or U, or Grade 11 U or M, or equivalent course. Canadian citizens and permanent residents may satisfy the English and/or mathematics requirements for this program through successful Seneca pre-admission testing."
  },
  {
    "name": "Financial Services Compliance Administration",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$5,401",
    "url": "https://www.senecacollege.ca/programs/fulltime/FCA.html",
    "duration": "2 Semesters (8 Months)",
    "phone": "(416)-493-4144",
    "description": "White-collar crime is increasing, particularly in the areas of identity theft, money laundering and securities fraud and therefore the need for compliance and risk management professionals is growing in the financial services industry. ",
    "requiredIelts": {},
    "requirements": "Ontario university or college degree or college diploma or equivalent. Applicants with an equivalent combination of partial postsecondary and/or three to five years of related work experience may be considered for admission. A relevant resumé and references must be provided. English proficiency for graduate certificates. Canadian citizens or permanent residents educated outside of Canada must provide a World Education Services (WES) or ICAS Canada credential evaluation."
  },
  {
    "name": "Financial Technology",
    "campus": "Seneca Downtown, Hybrid Delivery",
    "email": "admissions@senecacollege.ca",
    "tuition": "$6,372",
    "url": "https://www.senecacollege.ca/programs/fulltime/FNT.html",
    "duration": "2 Semesters (8 Months)",
    "phone": "(416)-493-4144",
    "description": "In this eight-month graduate certificate program, you will work with innovative and disruptive technologies used in the financial service sector. The program’s expert faculty will outline best practices for product development and entrepreneurship and enhance your understanding of privacy, ethics and the regulatory landscape of financial technology. The program covers topics including cybersecurity, web application and mobile development as well as data analytics for financial services.",
    "requiredIelts": {},
    "requirements": "Ontario university or college degree or college diploma or equivalent in computer technology, finance or a related program. Applicants with an equivalent combination of academic and recent related work experience in finance and/or information technology that demonstrates a foundation in data sciences/programming may be considered for admission. A relevant resumé and references must be provided. English proficiency for graduate certificates. Canadian citizens or permanent residents educated outside of Canada must provide a World Education Services (WES) or ICAS Canada credential evaluation."
  },
  {
    "name": "Fraud Examination and Forensic Accounting",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$5,401",
    "url": "https://www.senecacollege.ca/programs/fulltime/FEA.html",
    "duration": "2 Semesters (8 Months)",
    "phone": "(416)-493-4144",
    "description": "With the growth of white-collar crime and budgetary pressures on law enforcement, many large organizations rely on their internal resources to prevent, detect and quantify fraud. This eight-month graduate certificate program will provide you with in-depth knowledge and computer techniques to investigate fraud, financial disputes and other irregularities in the business world. The Association of Certified Fraud Examiners (ACFE®) estimates that a typical organization loses 5% of its annual revenue to fraud or $3.5 trillion globally with over half never recovering the funds. Upon graduation from this program, you are strongly encouraged to pursue Certified Fraud Examiner (CFE) designation through the ACFE®.",
    "requiredIelts": {},
    "requirements": "Ontario university or college degree or college diploma or equivalent. Previous studies must include a course or courses in accounting fundamentals, or applicants must show accounting work experience confirmed by a resumé and references. English proficiency for graduate certificates. Canadian citizens or permanent residents educated outside of Canada must provide a World Education Services (WES) or ICAS Canada course-by-course (comprehensive) credential evaluation."
  },
  {
    "name": "Honours Bachelor of Commerce - Financial Services Management",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$7,471",
    "url": "https://www.senecacollege.ca/programs/fulltime/FSM.html",
    "duration": "8 Semesters (4 Years)",
    "phone": "(416)-493-4144",
    "description": "Toronto is the second largest North American financial hub after New York and employs more than 251,000 people in the financial sector. This four-year honours degree supports your development of key skills for careers in banking, insurance, and investments. With a focus on financial planning and client service expertise. You will develop your knowledge and understanding of fintech, business law, accounting, financial advice, and financial crime investigation within the financial services.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD) or equivalent, including six Grade 12 U or M courses with a minimum overall average of 65%, or a mature applicant (21 years or older). Required courses with minimum final grade of  65% in each: English: Grade 12 ENG4U. Mathematics: any Grade 12 U. Mature applicants should disclose all previous postsecondary transcripts which may be used for admission decisions."
  },
  {
    "name": "Honours Bachelor of Commerce - International Accounting and Finance",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$7,471",
    "url": "https://www.senecacollege.ca/programs/fulltime/IAF.html",
    "duration": "8 Semesters (4 Years)",
    "phone": "(416)-493-4144",
    "description": "In this four-year honours degree program you will develop accounting, finance, management, and technology competencies. You will learn how to prepare, interpret and analyze financial information and be on the path toward a professional accounting designation. With this unique accounting education you will be job-ready for the Canadian and global business environments.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD) or equivalent, including six Grade 12 U or M courses with a minimum overall average of 65%, or a mature applicant (21 years or older). Required courses with minimum final grade of  65% in each: English: Grade 12 ENG4U. Mathematics: any Grade 12 U. Mature applicants should disclose all previous postsecondary transcripts which may be used for admission decisions."
  },
  {
    "name": "Professional Accountancy",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$7,014",
    "url": "https://www.senecacollege.ca/programs/fulltime/ACY.html",
    "duration": "1 Semesters (4 Month)",
    "phone": "(416)-493-4144",
    "description": "This four-month certificate program is developed for accounting degree graduates pursuing a professional accounting designation and will allow you to complete the core and elective modules of the Chartered Professional Accountants (CPA) Professional Education Program (PEP) in four months of rigorous, concentrated study. The program will prepare you to enter with advanced standing into the CPA PEP Capstone 1 and 2 modules. You will acquire advanced knowledge and competencies in accounting, taxation, assurance, performance management and finance. Additionally, this program will significantly increase your knowledge and understanding of the accounting field.",
    "requiredIelts": {},
    "requirements": "Completion of the CPA-Accredited stream in Seneca's Bachelor of Commerce – International Accounting and Finance (IAF) degree, or equivalent. A minimum grade of 60% in each the non-core courses. A minimum grade of 65% in each of the core courses and overall average of 70% being calculated on the core courses. Completed a degree at another postsecondary institution (i.e. applicants that have not completed the Seneca Bachelor of Commerce- IAF program) may be granted admission following a review of their official transcript(s) and supporting documentation (including course outlines) to verify that the courses completed developed the equivalent competencies to those developed in the IAF stream of core and non-core courses and that the minimum grade requirements have been met."
  },
  {
    "name": "Professional Accounting Practice",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$8,678",
    "url": "https://www.senecacollege.ca/programs/fulltime/PRA.html",
    "duration": "3 Semesters Consecutive (42 Weeks)",
    "phone": "(416)-493-4144",
    "description": "This 12-month graduate certificate program is a fast-track option for four-year degree graduates to pursue a career in accounting wishing to pursue the Chartered Professional Accountants (CPA) designation. You will study financial and management accounting, tax, information systems, audit, finance and economics focusing on analysis and interpretation of information and making sound ethical decisions. You will be introduced to the modern technological environment of business using spreadsheets (Excel), database software (Access) and integrated database application technologies (ERP) through exposure to accounting software package(s). You will also gain industry exposure through research, case studies and projects. You are eligible to enrol in this program with little or no knowledge of accounting. Upon graduation, you can choose to continue to complete an accounting degree such as Seneca's International Accounting and Finance degree, or pursue your CPA professional designation (minimum grade requirements apply).",
    "requiredIelts": {},
    "requirements": "Ontario university or college degree or equivalent. English proficiency for graduate certificates. Canadian citizens or permanent residents educated outside of Canada must provide a World Education Services (WES) or ICAS Canada credential evaluation."
  },
  {
    "name": "Business",
    "campus": "Newnham, Seneca International Academy",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,690",
    "url": "https://www.senecacollege.ca/programs/fulltime/BBS.html",
    "duration": "4 Semesters (2 Years)",
    "phone": "(416)-493-4144",
    "description": "This two-year diploma program will establish your understanding of business management and entrepreneurship and introduce you to the digital tools and the skills necessary to succeed in the modern economy. Through practical hands-on classroom activities, and close interactions with our experienced faculty, you will learn about making business decisions, planning, teamwork and utilizing relevant business computer applications. Upon completion of this program, you will have the option to enrol in one of Seneca’s three-year business administration programs and earn an advanced diploma in two additional semesters.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant English: Grade 12 C or U, or equivalent course. Mathematics: Grade 12 C or U, or Grade 11 U or M, or equivalent course"
  },
  {
    "name": "Business Administration - Entrepreneurship and Small Business",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,690",
    "url": "https://www.senecacollege.ca/programs/fulltime/BAS.html",
    "duration": "6 Semesters (3 Years)",
    "phone": "(416)-493-4144",
    "description": "In this three-year advanced diploma program, you will develop a solid understanding of contemporary management theory before learning the skills required to plan, start-up, manage and expand a successful small business. You will learn to research, analyze, plan and assess current situations, contribute to strategies, and lead and work effectively within teams. You will also develop your skills to use applications and technologies to support your organization’s business goals. Your learning will be further supported by instructors and business owners who will share their expertise and guide you through the process of identifying innovative and promising venture ideas from their business plans. Seminars, case analysis and online business simulations will be an integral part of your learning process. As a student of this program, you may earn the opportunity to participate in Seneca’s Shark’s Pond event. Here, you will pitch and defend your business ideas to industry leaders. Many past competitors have launched their business ideas after graduating.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course. Mathematics: Grade 12 C or U, or Grade 11 U or M, or equivalent course"
  },
  {
    "name": "Business Administration - Management",
    "campus": "Newnham, Seneca International Academy",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,690",
    "url": "https://www.senecacollege.ca/programs/fulltime/BAG.html",
    "duration": "6 Semesters (3 Years)",
    "phone": "(416)-493-4144",
    "description": "In this three-year advanced diploma program, you will gain fundamental skills and knowledge to deal with the challenging and sometimes fast-paced situations within the management function of an organization. You will learn to research, analyze, plan and assess current situations: contribute to strategies, and lead and work effectively within teams. You will also learn to use applications and technologies to support your organization’s business goals. You will build a practical understanding of contemporary management theory through innovative approaches to learning, including seminars, value-added presentations, case competitions, and applied research projects. Your learning will be further advanced by current and industry expert faculty members. As a student of this program, you will benefit from an expert team of professors and external speakers who have industry currency and academic expertise.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course. Mathematics: Grade 12 C or U, or Grade 11 U or M, or equivalent course"
  },
  {
    "name": "Business Administration - Purchasing and Supply Management",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,690",
    "url": "https://www.senecacollege.ca/programs/fulltime/BAO.html",
    "duration": "6 Semesters (3 Years)",
    "phone": "(416)-493-4144",
    "description": "This three-year advanced diploma program provides you with the in-depth understanding of how the increasingly strategic nature of purchasing influences other major functional areas of an organization. The program will help you pursue careers in purchasing, supply chain management, inventory management or logistics. You will also build a practical understanding of contemporary management theory and learn about tools that are essential to managing the supply base of an organization. Your learning will be enhanced through seminars, plant tours, case analysis and business simulations. Your learning will be further advanced by current and industry expert faculty members.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course. Mathematics: Grade 12 C or U, or Grade 11 U or M, or equivalent course"
  },
  {
    "name": "Business Analytics",
    "campus": "Hybrid Delivery, Newnham, Seneca International Academy",
    "email": "admissions@senecacollege.ca",
    "tuition": "$5,639",
    "url": "https://www.senecacollege.ca/programs/fulltime/BAN.html",
    "duration": "2 Semesters (1 Years)",
    "phone": "(416)-493-4144",
    "description": "This one-year graduate certificate program will provide you with the skills to identify and collect meaningful data, prepare data for analysis, conduct analysis of data sets and present results in a meaningful format to help inform business decisions across the enterprise. Key topics of study include: statistics needed for analytics, programming languages for data analysis, security and privacy for the field of business analytics, data predictive analytics and leadership in the business environment.",
    "requiredIelts": {},
    "requirements": "Ontario university/college degree, college diploma, advanced diploma or equivalent in a computer technology/engineering program or a business program with IT knowledge. Applicants with a combination of partial postsecondary and/or significant relevant work experience that is the equivalent of the above may be considered. A relevant resume and references must be provided. English proficiency at the postsecondary level."
  },
  {
    "name": "Honours Bachelor of Commerce - Business Management",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$7,561",
    "url": "https://www.senecacollege.ca/programs/fulltime/BBM.html",
    "duration": "8 Semesters (4 Years)",
    "phone": "(416)-493-4144",
    "description": "This four-year degree program will provide you with the fundamental principles of a well-rounded undergraduate education and a solid foundation in business management. Students learn strategic management concepts in a variety of business settings that include planning, organizing, leading and evaluating. They also learn how to apply business management techniques to areas such as finance, operations, human resources and marketing for-profit and non-profit businesses and organizations. Other study topics include business ethics, customer service, selling, presentation skills, global supply chain management, taxation and applied research methodology. ",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD) or equivalent, including six Grade 12 U or M  courses with a minimum overall average of 65%, or a mature applicant (21 years or older). Required courses with minimum final grade of  65% in each: English: Grade 12 ENG4U. Mathematics: any Grade 12 U"
  },
  {
    "name": "Non-Profit and Social Sector Management",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$6,432",
    "url": "https://www.senecacollege.ca/programs/fulltime/NPM.html",
    "duration": "2 Semesters (8 Months)",
    "phone": "(416)-493-4144",
    "description": "This eight-month graduate certificate program will provide you with an in-depth understanding of how to lead and manage a non-profit organization towards sustainable growth. You will learn about program planning, development and evaluation, transparent and ethical corporate governance, and marketing and sales practices. You will explore the latest trends in fundraising, partnerships-building, and volunteer engagement.",
    "requiredIelts": {},
    "requirements": "Ontario university or college degree or three-year college diploma or equivalent. Applicants with an equivalent combination of partial postsecondary and/or three to five years related work experience may be considered for admission. A relevant resumé and references must be provided. English proficiency for graduate certificates "
  },
  {
    "name": "Office Administration - Executive",
    "campus": "Seneca@York",
    "email": "admissions@senecacollege.ca",
    "tuition": "$6,691",
    "url": "https://www.senecacollege.ca/programs/fulltime/EXS/admission-requirements.html#pre-content_menu",
    "duration": "3 Semesters (12 Months)",
    "phone": "(416)-493-4144",
    "description": "This twelve-month diploma program will develop the administrative and technological skills you will need in order to meet the demands of the current and emerging business environment. Through practical, hands-on training you will acquire a knowledge of business office procedures, document preparation, Microsoft Office applications, basic human resources practices, professionalism and ethics.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant English: Grade 12 C or U, or equivalent course"
  },
  {
    "name": "Pre-Business",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,690",
    "url": "https://www.senecacollege.ca/programs/fulltime/PBS.html",
    "duration": "2 Semesters (8 Months)",
    "phone": "(416)-493-4144",
    "description": "In this eight-month certificate program, you will acquire a solid foundation of business principles plus the basics of marketing and accounting. This program will prepare you to continue your education through programs such as Accounting, Business, Business - Insurance, Business - International Business and Business – Marketing. ",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD) or equivalent with: Grade 12 English: ENG4(C) or ENG4(U). Grade 12 Mathematics: (C) or (U) or Grade 11 Mathematics: (C) or (M)"
  },
  {
    "name": "Sustainable Business Management",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$5,226",
    "url": "https://www.senecacollege.ca/programs/fulltime/SMB.html",
    "duration": "2 Semesters (8 Months)",
    "phone": "(416)-493-4144",
    "description": "This eight-month graduate certificate program focuses on the long-term economic, environmental and social value of sustainable business strategy. This program is designed to meet the growing needs of professionals who can propose, measure and evaluate sustainability initiatives. You will learn to develop and implement economically viable, lean business strategies for existing organizations or pursue entrepreneurship in sustainability. As a student of this program, you will have access to our HELIX innovation incubator.",
    "requiredIelts": {},
    "requirements": "Ontario university or college degree or three-year college diploma or equivalent. Applicants with an equivalent combination of partial postsecondary and/or three to five years related work experience may be considered for admission. A relevant resumé and references must be provided. English proficiency for graduate certificates "
  },
  {
    "name": "Business Administration - Human Resources",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,690",
    "url": "https://www.senecacollege.ca/programs/fulltime/BHR.html",
    "duration": "6 Semesters (3 Years)",
    "phone": "(416)-493-4144",
    "description": "This three-year advanced diploma program delivers relevant, current and in-demand skills and prepares you for a career in the growing area of Human Resources. Your studies will focus on topics such as recruiting, compensation, training, benefits, occupational health and safety, labour relations, leadership, motivational techniques and organizational behaviour. In addition, you will acquire skills in the effective use of industry-standard software. As a student, you will have the opportunity to interact directly with industry professionals and to participate in hands-on learning opportunities such as case competitions.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course. Mathematics: Grade 12 C or U, or Grade 11 U or M, or equivalent course"
  },
  {
    "name": "Honours Bachelor of Commerce - Human Resources Management",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$7,471",
    "url": "https://www.senecacollege.ca/programs/fulltime/HST.html",
    "duration": "8 Semesters (4 Years)",
    "phone": "(416)-493-4144",
    "description": "This four-year degree program combines theory with practice, allowing you to develop critical and strategic skills required for human resource management. You will gain necessary technical knowledge including HRIMS/SAP, data mining and metrics. As a graduate of this program, you will have the required knowledge to pursue several key industry designations such as: Certified Human Resources Professional (CHRP) designation through the Human Resources Professionals Association. The Microsoft Office Specialist Certificate through Microsoft",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD) or equivalent, including six Grade 12 U or M courses with a minimum overall average of 65%, or a mature applicant (21 years or older). Required courses with minimum final grade of  65% in each: English: Grade 12 ENG4U. Mathematics: any Grade 12 U"
  },
  {
    "name": "Human Resources Management",
    "campus": "Newnham, Seneca International Academy",
    "email": "admissions@senecacollege.ca",
    "tuition": "$5,840",
    "url": "https://www.senecacollege.ca/programs/fulltime/HRM.html",
    "duration": "2 Semesters (8 Months)",
    "phone": "(416)-493-4144",
    "description": "In the face of a changing workforce – including an aging population, increased number of retirements, and a challenging economic environment – organizations in Canada are placing an increased emphasis on strategic human resources management. The demand for qualified Human Resources professionals is increasing. This eight-month graduate certificate program will help you acquire a comprehensive background in the functions of human resources from both theoretical and practical perspectives. The focus of the program is on applied, relevant and current learning with opportunities to interact directly with industry professionals, and learn from qualified and award-winning faculty.",
    "requiredIelts": {},
    "requirements": "Ontario university or college degree or three-year college diploma or equivalent. Applicants with an equivalent combination of partial postsecondary and/or three to five years related work experience may be considered for admission. A relevant resumé and references must be provided. English proficiency for graduate certificates. Canadian citizens or permanent residents educated outside of Canada must provide a World Education Services (WES) or ICAS Canada credential evaluation."
  },
  {
    "name": "Business - International Business",
    "campus": "Newnham, Seneca International Academy",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,690",
    "url": "https://www.senecacollege.ca/programs/fulltime/BUI.html",
    "duration": "4 Semesters (2 Years)",
    "phone": "(416)-493-4144",
    "description": "This two-year diploma program will develop your knowledge of the complexities of the movement of goods and services across the globe. In addition to building your business management skills and knowledge, you will receive training in international selling and marketing, international trade documentation and transportation selection. You will apply communication, networking and teamwork skills to support international trade, using current applications and tools. You will also understand and learn to prepare documents and follow procedures to support the movement of products and services across international borders. Embracing cultural diversity, corporate sustainability and social responsibility are essential to your success in international business and are integral to your learning in this program. Your learning will be further advanced by current and industry expert faculty members.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course. Mathematics: Grade 12 C or U, or Grade 11 U or M, or equivalent course"
  },
  {
    "name": "Business Administration - International Business",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,690",
    "url": "https://www.senecacollege.ca/programs/fulltime/BAB.html",
    "duration": "6 Semesters (3 Years)",
    "phone": "(416)-493-4144",
    "description": "In this three-year advanced diploma program you will concentrate on the complexities that are involved in the movement and marketing of products and services internationally. You will build a foundation of general business knowledge and applications. Your learning will focus on the complexities of international trade that includes exporting, importing, international marketing, international finance, negotiation and entrepreneurship. You will also learn how to use industry leading Enterprise Resource Planning (ERP) tools, including SAP and other software. The program offers a rich and diverse intercultural educational experience. You will learn your craft from faculty with current industry experience in international business. This program is accredited by Forum for International Trade Training (FITT).",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course. Mathematics: Grade 12 C or U, or Grade 11 U or M, or equivalent course"
  },
  {
    "name": "Honours Bachelor of Commerce - International Business Management",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$7,561",
    "url": "https://www.senecacollege.ca/programs/fulltime/BMI.html",
    "duration": "8 Semesters (4 Years)",
    "phone": "(416)-493-4144",
    "description": "This four-year degree program is designed to provide you with specialized knowledge and skills in international business. The degree-level program builds upon the solid foundation of a well-rounded management education including accounting, finance, marketing, human resources, ethics and strategy. As you move into the intermediate and advanced years, the BMI program emphasizes business and supply chain processes that cross international boundaries and focuses on the complexities of operating in an international environment. Application of business technology is integrated throughout the program to introduce students to enterprise resource planning concepts and techniques.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD) or equivalent, including six Grade 12 U or M courses with a minimum overall average of 65%, or a mature applicant (21 years or older). Required courses with minimum final grade of  65% in each: English: Grade 12 ENG4U. Mathematics: any Grade 12 U"
  },
  {
    "name": "International Business Management",
    "campus": "Newnham, Seneca International Academy",
    "email": "admissions@senecacollege.ca",
    "tuition": "$4,796",
    "url": "https://www.senecacollege.ca/programs/fulltime/IBS.html",
    "duration": "2 Semesters (8 Months)",
    "phone": "(416)-493-4144",
    "description": "Elevate your business knowledge in this comprehensive eight-month graduate certificate program where you will learn about the complex world of international business. You will learn from experienced industry professionals with first-hand knowledge of today’s global business environment. With an emphasis on collaborative, project-based learning, case analysis and in-class discussions, you will cultivate essential critical-thinking skills. Team research and analysis of a real Canadian company will culminate in the development of an international export business plan.  ",
    "requiredIelts": {},
    "requirements": "Ontario university or college degree or three-year college diploma or equivalent. Applicants with an equivalent combination of partial postsecondary and/or three to five years related work experience may be considered for admission. A relevant resumé and references must be provided. English proficiency for graduate certificates "
  },
  {
    "name": "International Transportation and Customs",
    "campus": "Newnham, Seneca International Academy",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,690",
    "url": "https://www.senecacollege.ca/programs/fulltime/TCS.html",
    "duration": "4 Semesters (2 Years)",
    "phone": "(416)-493-4144",
    "description": "This two-year diploma program provides you with a solid technical understanding and practical knowledge of international transportation, customs brokerage and international freight forwarding. You will gain valued expertise and knowledge to help companies effectively manage the movement of goods and services internationally in our complex global economy. Your learning will be further advanced by current and industry expert faculty members. As a graduate of this program, you will receive a certificate from MSR, the e-customs company, and there will be opportunities for you to pursue a certificate in international freight forwarding from the Canadian International Freight Forwarders Association (CIFFA).",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course. Mathematics: Grade 12 C or U, or Grade 11 U or M, or equivalent course"
  },
  {
    "name": "Supply Chain Management - Global Logistics",
    "campus": "Newnham, Seneca International Academy",
    "email": "admissions@senecacollege.ca",
    "tuition": "$5,855",
    "url": "https://www.senecacollege.ca/programs/fulltime/SCM.html",
    "duration": "2 Semesters (8 Months)",
    "phone": "(416)-493-4144",
    "description": "In today's competitive environment, managing the supply chain and effectively controlling supply chain costs is critical for business. This has created a demand for employees with current skills and knowledge on how to effectively manage the supply chain using up-to-date tools, processes and technology. This eight-month graduate certificate program provides you with a concentrated and coordinated approach to study the flow of goods and services from raw material suppliers to the final customer. This product flow will be reviewed from a global perspective, providing you with a comprehensive understanding of the international business process. You will learn using hands-on interactive methods, including case-studies, making your experience relevant and applied.",
    "requiredIelts": {},
    "requirements": "Ontario university or college degree or three-year college diploma or equivalent. Applicants with an equivalent combination of partial postsecondary and/or three to five years related work experience may be considered for admission. A relevant resumé and references must be provided. English proficiency for graduate certificates "
  },
  {
    "name": "Library and Information Technician",
    "campus": "Seneca@York",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,573",
    "url": "https://www.senecacollege.ca/programs/fulltime/LIT.html",
    "duration": "4 Semesters (2 Years)",
    "phone": "(416)-493-4144",
    "description": "This two-year diploma program prepares you to work in various library environments, performing essential day-to-day library operations and working alongside librarians.  Learn to provide materials, information and services to library clients. Become an expert in acquiring, preparing and organizing all types of library materials, using software specific to the library and information industry.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course"
  },
  {
    "name": "Library and Information Technician (Accelerated)",
    "campus": "Seneca@York",
    "email": "admissions@senecacollege.ca",
    "tuition": "$5,332",
    "url": "https://www.senecacollege.ca/programs/fulltime/LITA.html",
    "duration": "3 Semesters (12 Months)",
    "phone": "(416)-493-4144",
    "description": "This accelerated 12-month version of the Library and Information Technician program prepares you to work in various library environments, performing essential day-to-day library operations and working alongside librarians. Learn to provide materials, information and services to library clients. Become an expert in acquiring, preparing and organizing all types of library materials, using software specific to the library and information industry.",
    "requiredIelts": {},
    "requirements": "Ontario university or college degree, or college diploma, or equivalent. Applicants with substantial completion of a degree (75%) may be considered for admission. Three postsecondary general education credits. One postsecondary English credit"
  },
  {
    "name": "Brand Management",
    "campus": "Markham, Moving to Seneca@York May 2020",
    "email": "admissions@senecacollege.ca",
    "tuition": "$4,440",
    "url": "https://www.senecacollege.ca/programs/fulltime/BMK.html",
    "duration": "2 Semesters (8 Months)",
    "phone": "(416)-493-4144",
    "description": "Ontario university or college degree or equivalent with a specialization in a marketing-related discipline. Applicants with an equivalent combination of partial postsecondary and/or three years of related work experience may be considered for admission. A relevant resumé and references must be provided. English proficiency for graduate certificates ",
    "requiredIelts": {},
    "requirements": "This eight-month graduate certificate program focuses on providing you with the skills and knowledge to develop and execute successful brand strategies in today's consumer-focused digital environment. You will understand all aspects of a brand and then develop a plan to build successful brand equity. Your learning will be further advanced through a range of instructional styles, case studies and relationship-building with industry professionals through industry/association field work or optional work term."
  },
  {
    "name": "Business - Marketing",
    "campus": "Markham, Moving to Seneca@York May 2020, Seneca International Academy",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,690",
    "url": "https://www.senecacollege.ca/programs/fulltime/BMT.html",
    "duration": "4 Semesters (2 Years)",
    "phone": "(416)-493-4144",
    "description": "This two-year diploma program will provide you with a solid foundation of marketing. You will have a detailed understanding of integrated marketing communications, selling, strategies and analysis, web design, research and channel management. You will be equipped with tools and techniques to create multi-objective marketing strategies, including promotional campaigns, pricing, packaging and distribution of products, services and ideas. You will also benefit from problem-based learning, real-world projects and case studies.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course. Mathematics: Grade 12 C or U, or Grade 11 U or M, or equivalent course"
  },
  {
    "name": "Business Administration - Marketing",
    "campus": "Markham, Moving to Seneca@York May 2020",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,690",
    "url": "https://www.senecacollege.ca/programs/fulltime/BAM.html",
    "duration": "6 Semesters (3 Years)",
    "phone": "(416)-493-4144",
    "description": "This three-year advanced diploma program will prepare you to become a marketing leader. You will learn to develop, integrate and execute marketing strategies for new and existing products and services. You will be challenged to be creative, analytical and tactical to identify, build and sustain a loyal customer base through unique marketing approaches. Your learning will be further advanced through the use of innovative and applied delivery techniques such as problem-based learning, real-life projects and case study analysis.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course. Mathematics: Grade 12 C or U, or Grade 11 U or M, or equivalent course"
  },
  {
    "name": "Creative Advertising",
    "campus": "Markham, Moving to Seneca@York May 2020",
    "email": "admissions@senecacollege.ca",
    "tuition": "$4,142",
    "url": "https://www.senecacollege.ca/programs/fulltime/CAB.html",
    "duration": "4 Semesters (2 Years)",
    "phone": "(416)-493-4144",
    "description": "This two-year diploma program will expose you to the different aspects of advertising communications including strategic planning, concept development, digital content creation and management, copywriting, art direction, account management, applied research and public relations. You will be challenged to be a creative and imaginative thinker, strong-willed, and a superior writer with solid interpersonal skills. Each semester of this program offers a building-block process with fundamentals and real-life experiences delivered by industry expert professors and advertising agency partners to nurture and inspire your creativity. Throughout each semester, you will also have opportunities to develop and present full-fledged ad campaigns.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course"
  },
  {
    "name": "Creative Advertising (For Applicants Currently Attending York University)",
    "campus": "Markham, Moving to Seneca@York May 2020",
    "email": "admissions@senecacollege.ca",
    "tuition": "$4,142",
    "url": "https://www.senecacollege.ca/programs/fulltime/CABY.html",
    "duration": "4 Semesters (2 Years)",
    "phone": "(416)-493-4144",
    "description": "This two-year diploma program will expose you to the different aspects of advertising communications from strategic planning, concept development, digital content creation and management, copywriting, art direction, account management and applied research and public relations. You will be challenged to be a creative and imaginative thinker, strong-willed and a superior writer with solid interpersonal skills. To be eligible for this joint program between Seneca and York University, you must be a York University student who has completed: Two years of a BA program or Three years of an honours BA program",
    "requiredIelts": {},
    "requirements": "Completion of two years of a BA program, or three years of an Honours BA program at York University. Permission to enrol from York academic adviser"
  },
  {
    "name": "Event Marketing - Sports, Entertainment, Arts",
    "campus": "Markham, Moving to Seneca@York May 2020",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,913",
    "url": "https://www.senecacollege.ca/programs/fulltime/EVM.html",
    "duration": "2 Semesters (8 Months)",
    "phone": "(416)-493-4144",
    "description": "With this eight-month graduate certificate program, you will gain enhanced knowledge and training in the growing fields of sports, entertainment, event and experiential marketing. This program will demonstrate how to apply the fundamental principles of strategic marketing to event properties through case analysis, field projects and client proposals. This program will challenge your creativity and equip you to explore a career in event marketing that involves sponsor brand activation and developing live experiences that are amplified by digital and social media.",
    "requiredIelts": {},
    "requirements": "Ontario university or college degree or college diploma or equivalent. Applicants with an equivalent combination of partial postsecondary and/or three to five years of related work experience may be considered for admission. A relevant resumé and references must be provided. English proficiency for graduate certificates "
  },
  {
    "name": "Honours Bachelor of Commerce - Marketing",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$6,665",
    "url": "https://www.senecacollege.ca/programs/fulltime/BMRK.html",
    "duration": "8 Semesters (4 Years)",
    "phone": "(416)-493-4144",
    "description": "Through this four-year degree program, you will be qualified to develop marketing strategies across traditional and emerging digital media and distribution channels, aspiring towards 360-degree customer engagement with campaigns grounded in marketing analytics. Students will study a range of marketing strategies, and profound expertise in business analytics and marketing insights. You will also demonstrate an in-depth understanding of how marketing strategy fits into both the micro – and macro – business context.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD) or equivalent, including six Grade 12 U or M courses with a minimum overall average of 65%, or a mature applicant (21 years or older). Required courses with minimum final grade of  65% in each: English: Grade 12 ENG4U. Mathematics: any Grade 12 U"
  },
  {
    "name": "Marketing Management",
    "campus": "Markham, Moving to Seneca@York May 2020, Seneca International Academy",
    "email": "admissions@senecacollege.ca",
    "tuition": "$4,817",
    "url": "https://www.senecacollege.ca/programs/fulltime/MKM.html",
    "duration": "2 Semesters (8 Months)",
    "phone": "(416)-493-4144",
    "description": "This eight-month graduate certificate program will develop your fundamental knowledge of marketing management and channel your strength towards creating, building, communicating and delivering value to customers in innovative and creative ways. You will gain skills and knowledge in several key areas including marketing research techniques, launching a new product or service, market segmentation techniques, pricing strategies, promotion and communications strategies, strategic market planning, generating new accounts and sales revenues.",
    "requiredIelts": {},
    "requirements": "Ontario university or college degree or equivalent. Applicants with an equivalent combination of partial postsecondary and/or three to five years related work experience may be considered for admission. A relevant resumé and references must be provided. English proficiency for graduate certificates "
  },
  {
    "name": "Social Media",
    "campus": "Newnham, Moving to Seneca@York May 2020",
    "email": "admissions@senecacollege.ca",
    "tuition": "$5,836",
    "url": "https://www.senecacollege.ca/programs/fulltime/SMD.html",
    "duration": "2 Semesters (8 Months)",
    "phone": "(416)-493-4144",
    "description": "This eight-month graduate certificate program is delivered by a team of expert faculty members who will advance your knowledge of digital media fundamentals including social media platforms, tools, and techniques. You will learn to create content, develop campaigns and implement social media and digital engagement strategies to help organizations achieve their objectives. Through hands-on learning, you will learn how social media can be used in an organizational context. This program was developed in close consultation with industry leaders to ensure that you learn what is relevant, applicable across multiple disciplines and currently in demand.",
    "requiredIelts": {},
    "requirements": "Ontario university or college degree or three-year college diploma or equivalent. Applicants with an equivalent combination of partial postsecondary and/or three to five years related work experience may be considered for admission. A relevant resumé and references must be provided. English proficiency for graduate certificates "
  },
  {
    "name": "3D Animation",
    "campus": "Seneca@York",
    "email": "admissions@senecacollege.ca",
    "tuition": "$10,469",
    "url": "https://www.senecacollege.ca/programs/fulltime/DAN.html",
    "duration": "2 Semesters (8 Months)",
    "phone": "(416)-493-4144",
    "description": "This eight-month graduate certificate program will allow you to study 3D computer-based modelling and animation using high-end computer workstations, software and tools. You will learn the principles of animation to develop and master your knowledge of lighting, texturing and rendering, and fundamental elements of 3D animation.  ",
    "requiredIelts": {},
    "requirements": "Ontario university or college degree, or college diploma, or equivalent in fine art, 2D/3D animation, photography, film/video, architecture, or graphic design. Applicants with an equivalent combination of partial postsecondary and/or three to five years related work experience may be considered for admissions. A relevant resumé and references must be provided. Art portfolio. English proficiency for Graduate Certificate "
  },
  {
    "name": "Animation",
    "campus": "Seneca@York",
    "email": "admissions@senecacollege.ca",
    "tuition": "$8,350",
    "url": "https://www.senecacollege.ca/programs/fulltime/ANI.html",
    "duration": "6 Semesters (3 Years)",
    "phone": "(416)-493-4144",
    "description": "In this three-year advanced diploma program, you will attain skills and knowledge in both traditional and computer animation. As you learn to draw storyboards, design and animate characters and scenes, you will practice applying theories of motion, timing, storytelling and digital technology to produce high-quality animations and designs. The hands-on learning you receive will enable you to utilize the equipment, facilities and computer software currently used in the industry. This program is designed to equip you to successfully compete in the world of 2D and 3D animation. You can expect to acquire and grow knowledge and skills relevant to producing animation for the web, television, games or film.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course. Drawing and writing exercise. Art portfolio"
  },
  {
    "name": "Game Art and Animation",
    "campus": "Seneca@York",
    "email": "admissions@senecacollege.ca",
    "tuition": "$10,469",
    "url": "https://www.senecacollege.ca/programs/fulltime/GAA.html",
    "duration": "2 Semesters (8 Months)",
    "phone": "(416)-493-4144",
    "description": "This eight-month graduate certificate program is designed to turn talented artists into AAA game asset modellers. This unique program will have you creating and animating environments, characters and other assets within a 3D environment. Through this program you will learn modelling, lighting, texturing, animation, scene staging, art direction and production management. Your learning will be further advanced by using industry-relevant techniques taught by professors with years of industry experience. With high-end computer hardware and software, you will learn to use tools used to develop game art and incorporate it into real-time environments.",
    "requiredIelts": {},
    "requirements": "Ontario university or college degree or college diploma or equivalent in fine art, 2D/3D animation, photography, film/video, architecture or graphic design. Applicants with an equivalent combination of partial postsecondary or related work experience may be considered for admission. A relevant resumé and references must be provided. Art portfolio. English proficiency for graduate certificates "
  },
  {
    "name": "Visual Effects for Film and Television",
    "campus": "Seneca@York",
    "email": "admissions@senecacollege.ca",
    "tuition": "$10,469",
    "url": "https://www.senecacollege.ca/programs/fulltime/VFT.html",
    "duration": "2 Semesters (8 Months)",
    "phone": "(416)-493-4144",
    "description": "The eight-month Visual Effects for Film and Television program is a leading provider for training in the dynamic and challenging special effects industry. This is a Houdini-certified school and all other software taught (Maya, Nuke) is industry standard. You will work on assignments that mirror the practical work you would do at a VFX studio to create a high-quality portfolio.",
    "requiredIelts": {},
    "requirements": "Ontario university or college degree or college diploma or equivalent in fine art, 2D/3D animation, photography, film/video, architecture or graphic design. Letter of intent. Art/image portfolio. English proficiency for graduate certificates"
  },
  {
    "name": "Art Fundamentals",
    "campus": "Seneca@York",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,573",
    "url": "https://www.senecacollege.ca/programs/fulltime/AFD.html",
    "duration": "2 Semesters (8 Months)",
    "phone": "(416)-493-4144",
    "description": "The eight-month Art Fundamentals (AFD) certificate program provides a strong foundation in traditional and digital art. Designed to build skills in art, design, creativity, communication and critical thinking, AFD will prepare you for further education and a career path in fields such as animation, illustration and graphic design. You will experience hands-on learning under the guidance of working artists. This program will equip you with the knowledge and grounds to apply to other specialized art programs.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD) or equivalent with: Grade 12 English: ENG4(U) or ENG4(C) OR Mature Student Status (age 19 or older) with required course(s), their equivalent(s), or appropriate Academic and Career Entrance (ACE) Certificate program credits (see Academic Upgrading). Drawing exercise"
  },
  {
    "name": "Event Management - Event and Exhibit Design",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$4,095",
    "url": "https://www.senecacollege.ca/programs/fulltime/EVT.html",
    "duration": "2 Semesters (8 Months)",
    "phone": "(416)-493-4144",
    "description": "Ontario university or college degree or diploma, or equivalent. Online questionnaire and portfolio submission. English proficiency for graduate certificates ",
    "requiredIelts": {},
    "requirements": "Do you have an eye for detail? Do you enjoy planning events for your family and friends? Do you dream about creating experiences people can’t stop talking about? If any of this sounds like you — and you already have a postsecondary degree or diploma — the Event Management program is the perfect place to kick-start your career as an event planner and designer. In eight months, you’ll learn what it takes to execute real events for real clients in an exciting, fast-paced industry. Taught by a team of industry professionals, you’ll develop the skills you need to translate your design concepts into events that will leave your clients speechless. "
  },
  {
    "name": "Floral Design",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,690",
    "url": "https://www.senecacollege.ca/programs/fulltime/FDN.html",
    "duration": "2 Semesters (8 Months)",
    "phone": "(416)-493-4144",
    "description": "The art of floral design requires expertise with colour, materials, shape and space. Floral designers must understand how flowers and foliage become tools to achieve the right arrangement for the occasion. The eight-month Floral Design certificate program frames this understanding in a creative and business context to allow for artistic arrangements that satisfy the aesthetics of the designer and the customer. Through active, hands-on learning experiences in the floral lab, you will understand how to integrate theory and practice to produce the perfect design.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course"
  },
  {
    "name": "Graphic Design",
    "campus": "Seneca@York",
    "email": "admissions@senecacollege.ca",
    "tuition": "$5,260",
    "url": "https://www.senecacollege.ca/programs/fulltime/GRA.html",
    "duration": "6 Semesters (3 Years)",
    "phone": "(416)-493-4144",
    "description": "This three-year advanced diploma program will prepare you with the knowledge and skills necessary to create effective design solutions for interactive, print and experiential design projects. Fundamental principles and skills training, followed by immersive cross disciplinary learning, culminate with a graduate showcase portfolio and the opportunity to participate in a field placement. This program will prepare you to work as a designer in the communications industry.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course. Online applicant profile, drawing assignment and portfolio"
  },
  {
    "name": "Illustration",
    "campus": "Seneca@York",
    "email": "admissions@senecacollege.ca",
    "tuition": "$4,362",
    "url": "https://www.senecacollege.ca/programs/fulltime/ILS.html",
    "duration": "4 Semesters (16 Months Consecutive)",
    "phone": "(416)-493-4144",
    "description": "This two-year creative diploma program combines traditional illustrative media, digital media and business which will educate you to succeed as a professional illustrator. The program specialties include children’s book illustration, comics, spot and advertising illustration and concept art for film and game animation. In addition to building on visual art skills such as drawing, painting, printmaking, sculpture and digital media, you may also be able to register your own small business. You will have the skills to succeed as an entrepreneurial artist with a website, accounting, marketing and revenue generating skills in the curriculum.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD) or equivalent with Grade 12 English: ENG4(U) or ENG4(C). OR Mature Student Status (age 19 or older) with required course(s), their equivalent(s), or appropriate Academic and Career Entrance (ACE) Certificate program credits (see Academic Upgrading). Attend an admission session and complete a drawing and writing assignment. Submit a portfolio of work online – the portfolio should include: Three life drawings. Two drawings of your own hand. Two object drawings. Two environment drawings. Two drawings of your choice. A written profile. A resume with the focus on any professional or volunteer positions that demonstrate creative or artistic talents"
  },
  {
    "name": "Interactive Media Design",
    "campus": "Seneca@York",
    "email": "admissions@senecacollege.ca",
    "tuition": "$5,095",
    "url": "https://www.senecacollege.ca/programs/fulltime/INM.html",
    "duration": "4 Semesters (2 Years)",
    "phone": "(416)-493-4144",
    "description": "This two-year diploma program offers knowledge on design, development, implementation and management of digital strategies and multimedia applications. Your studies will provide you the ability to develop and manage both creative and technical strategies in the fields of graphic design, motion graphics, web technologies, as well as introduction to gaming and visual effects applications. As a part of your final semester, you will engage in an independent production and internship opportunity to acquire hands-on experience in the relevant field.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course. Applicant profile and questionnaire. Drawing and design exercise"
  },
  {
    "name": "Acting for Camera and Voice",
    "campus": "Seneca@York",
    "email": "admissions@senecacollege.ca",
    "tuition": "$5,774",
    "url": "https://www.senecacollege.ca/programs/fulltime/ACV.html",
    "duration": "4 Semesters (2 Years)",
    "phone": "(416)-493-4144",
    "description": "Seneca’s two-year Acting for Camera and Voice diploma program offers exciting, hands-on learning experiences in the unique blend of film and voice acting. You will learn techniques that will enable you to build a strong foundation of stage acting, movement, voice and camera acting. Your studies will teach you to research roles, how to create audio and video demo reels, how to write scripts and business management skills necessary to succeed in your acting career.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course. Online applicant profile. Live audition and interview"
  },
  {
    "name": "Independent Music Production",
    "campus": "Seneca@York",
    "email": "admissions@senecacollege.ca",
    "tuition": "$7,608",
    "url": "https://www.senecacollege.ca/programs/fulltime/IMP.html",
    "duration": "2 Semesters (8 Months)",
    "phone": "(416)-493-4144",
    "description": "In this eight-month certificate program, you will learn the skills necessary for success as an independent musician. Guided by professionals who are active in the industry, you will gain hands-on experience in home-based recording, music production and distribution and songwriting. You will also be taught business and entrepreneurial skills.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course. Online applicant profile and questionnaire. Music demo – original songs with bio"
  },
  {
    "name": "Independent Songwriting and Performance",
    "campus": "Seneca@York",
    "email": "admissions@senecacollege.ca",
    "tuition": "$7,608",
    "url": "https://www.senecacollege.ca/programs/fulltime/IPS.html",
    "duration": "2 Semesters (8 Months)",
    "phone": "(416)-493-4144",
    "description": "In this eight-month certificate program, your studies will focus on lyric and songwriting, studio preparation, performance, vocal skills, music theory and practice. The program offers basic training in technical and business skills essential to establishing your presence in the marketplace. You will experience hands-on learning through private and traditional classroom lessons led by working professionals in the industries. In your last semester, you will receive mentoring to complete and showcase a recording project that will be evaluated by the panel of faculty members. The evaluation will assist with your entrance into the music industry. ",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course. Online applicant profile and questionnaire. Music performance video"
  },
  {
    "name": "Social Service Worker",
    "campus": "King, Seneca@York, Yorkgate",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,721",
    "url": "https://www.senecacollege.ca/programs/fulltime/SSW.html",
    "duration": "4 Semesters (2 Years)",
    "phone": "(416)-493-4144",
    "description": "In this two-year diploma program you will gain the required knowledge and skills for the human service field and be challenged to examine your own values and beliefs to make a meaningful contribution to the profession. Your studies will include a range of topics in styles of lecture and tutorial-based, utilizing assigned texts which stress interpersonal skills, group dynamics, interviewing, counselling, relationship-building, community development and social policy. By combining your theoretical knowledge and field placement experiences you will also take part in a variety of classroom, seminar and experiential modalities. Upon graduation you will possess a comprehensive set of human service skills which are transferable to a wide range of settings and employment options. ",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course"
  },
  {
    "name": "Social Service Worker (Accelerated)",
    "campus": "King",
    "email": "admissions@senecacollege.ca",
    "tuition": "$5,554",
    "url": "https://www.senecacollege.ca/programs/fulltime/SSWA.html#pre-content_menu",
    "duration": "3 Semesters (1 Year)",
    "phone": "(416)-493-4144",
    "description": "This accelerated program provides you with the knowledge and skills needed to make a positive contribution in the human service field. Demanding and fast-paced, this program requires you to be in good academic standing and capable of challenging your own beliefs and values, promote social justice, human dignity and equity in preparation for the workforce.",
    "requiredIelts": {},
    "requirements": "Ontario university Bachelor of Arts degree, or equivalent in social sciences. Three postsecondary social science, or general education credits. One postsecondary English credit"
  },
  {
    "name": "Social Service Worker - Gerontology",
    "campus": "King",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,721",
    "url": "https://www.senecacollege.ca/programs/fulltime/SSWG.html",
    "duration": "4 Semesters (2 Years)",
    "phone": "(416)-493-4144",
    "description": "Canada now has more people over age 65 than any other age group and there is a great need for skilled and trained professionals to work with older adults. This two-year diploma program combines the knowledge, professional values and skill sets of social service to assist older adults to maintain independence and a good quality of life. The program focuses on a holistic strength-based approach, current legislation and best practices. Along with your studies in mandated government initiatives and service delivery models for working with seniors, you will have the opportunity to apply your knowledge infield placement and participate in additional educational training. As a student you will engage in personal reflection and growth, work within a team, apply professional ethics, and successfully achieve the Ministry Vocational Learning outcomes so you are prepared to confidently enter the workforce.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course"
  },
  {
    "name": "Social Service Worker - Immigrants and Refugees ",
    "campus": "Seneca@York",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,721",
    "url": "https://www.senecacollege.ca/programs/fulltime/SSWI.html",
    "duration": "4 Semesters (2 Years)",
    "phone": "(416)-493-4144",
    "description": "This two-year diploma program prepares you to succeed as a social service provider working with immigrants and refugees from diverse backgrounds. With a framework based on equity, social justice and anti-oppression principles, this program will provide insight and understanding of pre-migration conditions and how to effectively aid clients with migration and the integration process. ",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course"
  },
  {
    "name": "Social Service Worker - Immigrants and Refugees (Accelerated)",
    "campus": "Seneca@York",
    "email": "admissions@senecacollege.ca",
    "tuition": "$5,332",
    "url": "https://www.senecacollege.ca/programs/fulltime/SSIA.html",
    "duration": "3 Semesters (1 Year)",
    "phone": "(416)-493-4144",
    "description": "This accelerated one-year Social Service Worker Immigrants and Refugees program prepares you to succeed as a social service provider working with immigrants and refugees from diverse backgrounds. Through its demanding requirements and fast pace, your success will be measured by your ability to grow, change and challenge your own beliefs, values and promote social justice, human dignity and equality. Learning from a framework based on equity, social justice and anti-oppression principles, this program will provide insight and understanding of pre-migration conditions and how to effectively aid clients with migration and the integration process.",
    "requiredIelts": {},
    "requirements": "Ontario university Bachelor of Arts degree, or equivalent in social sciences. Three postsecondary social science or general education credits. One postsecondary English credit"
  },
  {
    "name": "Early Childhood Education",
    "campus": "King, Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,721",
    "url": "https://www.senecacollege.ca/programs/fulltime/ECE.html",
    "duration": "4 Semesters (2 Years)",
    "phone": "(416)-493-4144",
    "description": "In this four-semester diploma program, you will learn about the physical, cognitive, social and emotional needs of children. You will understand how to develop and implement inclusive programming in order to support the healthy development of children ranging in age from infancy to school-age. Your studies will include courses in child development, curriculum. philosophy of education, communication, working with families and administration. Each week you will spend three days in class and two days practicing your skills in field placement. If you choose to study in the summer, you will have the option to earn your Early Childhood Education (ECE) diploma in 16 months. Seneca offers two lab schools, which are model child care centres that provide you with opportunities for observation and programming.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course"
  },
  {
    "name": "Early Childhood Education (Accelerated)",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$5,507",
    "url": "https://www.senecacollege.ca/programs/fulltime/ECYA.html",
    "duration": "3 Semesters (35 Weeks)",
    "phone": "(416)-493-4144",
    "description": "The ECYA program is an accelerated program specially designed for those who have completed an undergraduate degree.  In the accelerated program, you are eligible to earn your Early Childhood Education diploma in 12 months. In this three-semester diploma program, you will learn about the physical, cognitive, social and emotional needs of children. You will understand how to develop and implement inclusive programming in order to support the healthy development of children ranging in age from infancy to school-age. Your studies will include courses in child development, curriculum, philosophy of education, communication, working with families and administration. Seneca offers two lab schools, which are model child care centres that provide you with opportunities for observation and programming.",
    "requiredIelts": {},
    "requirements": "Ontario university or college degree, or equivalent. Three postsecondary general education credits. One postsecondary English credit. Reference letter outlining previous experience with young children, either paid or volunteer"
  },
  {
    "name": "Honours Bachelor of Child Development",
    "campus": "King, Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$7,502",
    "url": "https://www.senecacollege.ca/programs/fulltime/BCD.html",
    "duration": "8 Semesters (4 Years)",
    "phone": "(416)-493-4144",
    "description": "The four-year Honours Bachelor of Child Development degree program prepares you for expansive opportunities across the health, education, and social service sectors. Upon completion of this program, you will be able to pursue careers in family support services, recreation, early learning and education, infant mental health, and early intervention for children and youth with diverse abilities. You will also qualify to register as a member of the College of Early Childhood Educator and practice as a Registered Early Childhood Educator (RECE). ",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD) or equivalent, including six Grade 12 U or M courses with a minimum overall average of 65%, or a mature applicant (21 years or older). Required course with minimum final grade of 65%: English: Grade 12 ENG4U"
  },
  {
    "name": "Behavioural Sciences",
    "campus": "King",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,721",
    "url": "https://www.senecacollege.ca/programs/fulltime/BHS.html",
    "duration": "4 Semesters (2 Years)",
    "phone": "(416)-493-4144",
    "description": "In this two-year program, you will study theories and clinical applications including the use of Applied Behaviour Analysis (ABA) – the science of understanding, analyzing and modifying human behaviour. Through applied learning and placement, you will learn the applications of ABA, including its use in the treatment of Autism Spectrum Disorders and other developmental disabilities. As a graduate of this program with a GPA of 3.0 or higher, you are eligible to pursue Seneca’s Honours Bachelor of Behavioural Psychology program. This unique pathway allows you to earn a degree within two years (4 semesters plus a work-term) after completion of a summer bridging stream. If you meet the admission requirements, you may also be eligible to receive a 42 credit block transfer when entering the Bachelor of Arts or Bachelor of Science Honours in Psychology within the Faculty of Health at York University.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course"
  },
  {
    "name": "Child and Youth Care",
    "campus": "King",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,721",
    "url": "https://www.senecacollege.ca/programs/fulltime/CYC.html",
    "duration": "6 Semesters (3 Years)",
    "phone": "(416)-493-4144",
    "description": "This three-year advanced diploma program will provide you with a full range of intervention, prevention and treatment strategies to facilitate a positive change for children, adolescents and families in need of emotional, social, developmental or mental health support. You will receive in-depth training and education in behavioural theories, practices and a foundational understanding of assessment, intervention, Autism Spectrum Disorder (ASD) and activities with children and youth.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course"
  },
  {
    "name": "Honours Bachelor of Behavioural Psychology",
    "campus": "King",
    "email": "admissions@senecacollege.ca",
    "tuition": "$6,696",
    "url": "https://www.senecacollege.ca/programs/fulltime/BBP.html",
    "duration": "8 Semesters (4 Years)",
    "phone": "(416)-493-4144",
    "description": "This program is the first four-year undergraduate honours degree in Canada that provides a comprehensive program of study in the rapidly growing field of Behavioural Psychology. With a curriculum based on the theory that adaptive and maladaptive behaviours are acquired through interaction with the environment, you will examine a range of subjects in psychology including behavioural intervention, behavioural techniques and the application of Applied Behaviour Analysis in clinical and non-clinical settings. You will graduate with in-depth theoretical, conceptual and applied knowledge in the field of behavioural psychology. Autism spectrum disorder (ASD) services are becoming more widely available in Ontario as funding has quadrupled over the last 10 years. Approximately one in 10 Canadians has a learning disability and in Ontario one in five children and youth has a mental health challenge.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD) or equivalent, including six Grade 12 U or M  courses with a minimum overall average of 65%, or a mature applicant (21 years or older). Required course with minimum final grade of 65%: English: Grade 12 ENG4U"
  },
  {
    "name": "Honours Bachelor of Community Mental Health",
    "campus": "King",
    "email": "admissions@senecacollege.ca",
    "tuition": "$6,696",
    "url": "https://www.senecacollege.ca/programs/fulltime/BCMH.html",
    "duration": "8 Semesters (4 Years)",
    "phone": "(416)-493-4144",
    "description": "Seneca is the first college to offer this four-year specialized degree program in the growing field of community mental health.  Students will study a range of essential topics to gain foundational knowledge in theoretical interventions and social determinants by focusing on health science, psychology and social work from both a practical and theoretical standpoint. The World Health Organization has established there is an overwhelming worldwide human resource shortage in community mental health. One-fifth of Canadians will personally experience mental illness in their lifetime and in Ontario one in five children and youth under the age of 17 has a mental health challenge. Mental health problems are predicted to increase by over 50% internationally by the year 2020.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD) or equivalent, including six Grade 12 U or M courses with a minimum overall average of 65%, or a mature applicant (21 years or older). Required courses with minimum final grade of  65% in each: English: Grade 12 ENG4U"
  },
  {
    "name": "Infant and Early Child Mental Health",
    "campus": "King",
    "email": "admissions@senecacollege.ca",
    "tuition": "$5,511",
    "url": "https://www.senecacollege.ca/programs/fulltime/IMH.html",
    "duration": "2 Semesters (8 Months)",
    "phone": "(416)-493-4144",
    "description": "This eight-month graduate certificate program provides you with additional training and skills to enhance your current career and open up new opportunities.  As a student in this program, you will study infant and children’s mental health, family dynamics, community mental health, therapeutic approaches and crisis intervention.  You will also acquire the skills, knowledge and judgment to make a positive contribution to the positive mental health of infants, children and families.",
    "requiredIelts": {},
    "requirements": "Ontario university or college degree or three-year college diploma or equivalent. Applicants with a two-year college diploma and at least six months of full-time work experience in early childhood development or a related field may be considered for admission. A relevant resumé and references must be provided. English proficiency for graduate certificates "
  },
  {
    "name": "Mental Health Intervention",
    "campus": "King",
    "email": "admissions@senecacollege.ca",
    "tuition": "$6,428",
    "url": "https://www.senecacollege.ca/programs/fulltime/MHI.html",
    "duration": "2 Semesters (8 Months)",
    "phone": "(416)-493-4144",
    "description": "This eight-month graduate certificate program enhances the knowledge and skill sets of front line service providers or recent graduates of relevant programs with a specialization in mental health intervention. Along with studying theoretical and practical course content in family dynamics, community mental health and crisis intervention, you will be introduced to practical applications of the latest research and develop an understanding of risk, protective factors as well as early intervention applications. This training will prepare you to provide expertise to individuals and families in need of support. During your second semester, the unique ‘Community Outreach’ course challenges your abilities to innovate new practices in the field. You will be placed on a team with fellow students where you will develop original modules based on best practices in mental health detection, prevention and outreach thereby contributing to the expansion of mental health knowledge and practices to the broader community. As a graduate of this program with a GPA of 3.0 or higher, you are eligible to pursue Seneca’s Honours Bachelor of Community Mental Health (BCMH) degree program. Students need to apply on an individual basis and have their transcripts reviewed by the BCMH Academic Co-ordinator to determine the transfer credits that they would be qualified to receive.",
    "requiredIelts": {},
    "requirements": "Ontario university or college degree or college diploma or equivalent in community studies, health and public safety or a related program. English proficiency for graduate certificates "
  },
  {
    "name": "Mechanical Engineering Technician (Tool Design)",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,690",
    "url": "https://www.senecacollege.ca/programs/fulltime/MATD.html",
    "duration": "4 Semesters (2 Years)",
    "phone": "(416)-493-4144",
    "description": "In this two-year diploma program, you will learn to use the latest computer software to assist in the manufacturing of production tools. You will learn and gain valuable skills in conventional manufacturing technologies, computer production and design along with prototyping techniques and quality control. You will have the opportunity to experience the practical production considerations of tool design as you gain experience in a fully equipped machining lab.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course. Mathematics: Grade 12 C or U, or Grade 11 Functions (MCR3U), or equivalent course"
  },
  {
    "name": "Mechanical Engineering Technology - Industrial Design",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,690",
    "url": "https://www.senecacollege.ca/programs/fulltime/MIT.html",
    "duration": "6 Semesters (3 Years)",
    "phone": "(416)-493-4144",
    "description": "In this three-year advanced diploma program, you will increase your knowledge of design and engineering principles. You will learn to apply theories of design, production and marketing to gain an understanding of the steps necessary to commercialize a design idea. Your studies will introduce you to machining and production techniques, rapid prototyping, principles of mechanical design, engineering analysis, marketing, basic accounting practices, entrepreneurial skills, ergonomics, basic electricity and electronics, reverse engineering and product and design digitizing.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course, Mathematics: Grade 12 C or U, or Grade 11 Functions (MCR3U), or equivalent course"
  },
  {
    "name": "Mechanical Technician - CNC Programming",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,690",
    "url": "https://www.senecacollege.ca/programs/fulltime/MTCP.html",
    "duration": "4 Semesters (2 Years)",
    "phone": "(416)-493-4144",
    "description": "This two-year diploma program will introduce you to modern manufacturing techniques including programming and Computer Assisted Manufacturing (CAM). You will study both theory and practical aspects of modern metal machining and cutting while focusing on programming, advanced manufacturing techniques and interpreting engineering drawings. Upon completion of this program, you may begin an apprenticeship with an employer as a general machinist, tool and die maker, or mould maker.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course, Mathematics: Grade 12 C or U, or Grade 11 Functions (MCR3U), or equivalent course"
  },
  {
    "name": "Mechanical Techniques (Tool and Die/Mould Making)",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,690",
    "url": "https://www.senecacollege.ca/programs/fulltime/MATT.html",
    "duration": "2 Semesters (8 Months)",
    "phone": "(416)-493-4144",
    "description": "This eight-month certificate program will introduce you to modern manufacturing techniques including programming and Computer Assisted Manufacturing (CAM). You will study both theory and practical aspects of modern metal machining and cutting while focusing on programming, advanced manufacturing techniques and interpreting engineering drawings.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course, Mathematics: Grade 12 C or U, or Grade 11 Functions (MCR3U), or equivalent course"
  },
  {
    "name": "Underwater Skills",
    "campus": "King",
    "email": "admissions@senecacollege.ca",
    "tuition": "$4,442",
    "url": "https://www.senecacollege.ca/programs/fulltime/UWS.html#pre-content_menu",
    "duration": "34 Weeks",
    "phone": "(416)-493-4144",
    "description": "This rigorous and fast-paced program has been preparing commercial divers for a variety of industry careers for more than 45 years. That’s why contractors continue to contact Seneca looking for skilled graduates to work in offshore construction, salvage, inspection, offshore oil and gas exploration, and production. In this 35-week program, you will dive to a maximum of 50 metres (165 feet), led by Seneca’s Unrestricted Surface Supplied Supervisors, who have more than 100 years of combined commercial diving experience. Graduates will receive an internationally recognized certificate as an Unrestricted Surface Supplied Diver from the Diver Certification Board of Canada (DCBC).",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course, Mathematics: Grade 12 C or U, or Grade 11 U or M, or equivalent course, English proficiency test"
  },
  {
    "name": "Building Systems Engineering Technician",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,690",
    "url": "https://www.senecacollege.ca/programs/fulltime/BTS.html",
    "duration": "4 Semesters (2 Years)",
    "phone": "(416)-493-4144",
    "description": "In this two-year diploma program, you will use building systems software to learn leading theory and practice for heating, air conditioning, refrigeration, air handling, electricity and control systems. You will learn the principles of energy efficiency, including the exploration of emerging renewable energy technologies, which are a major component. Students who begin their studies in January are not eligible for co-op, and are required to begin their second semester immediately after the first semester",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course, Mathematics: Grade 12 C or U, or Grade 11 Functions (MCR3U), or equivalent course"
  },
  {
    "name": "Chemical Engineering Technology",
    "campus": "Seneca@York",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,573",
    "url": "https://www.senecacollege.ca/programs/fulltime/CHY.html",
    "duration": "6 Semesters (3 Years)",
    "phone": "(416)-493-4144",
    "description": "In this three-year advanced diploma program, you will be training for an exciting career as a chemical technologist with specializations in chemical analysis, applied chemical engineering and environmental chemistry. This program will provide you with hands-on experience and a solid background in basic biology, chemistry and mathematics. You will further focus on analytical and instrumental chemistry, organic, industrial and polymer chemistry, metallurgy, ceramics, composites and environmental analysis, health and chemistry.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course, Mathematics: Grade 12 C or U, or Grade 11 Functions (MCR3U), or equivalent course, Biology: Grade 11 C or U, or equivalent course, Chemistry: Grade 12 C or U, or equivalent course"
  },
  {
    "name": "Civil Engineering Technician",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,690",
    "url": "https://www.senecacollege.ca/programs/fulltime/CVL.html",
    "duration": "4 Semesters (2 Years)",
    "phone": "(416)-493-4144",
    "description": "In this two-year diploma program, you will learn the fundamentals to prepare for a career as a civil engineering technician. Your studies will include computer drafting, municipal and building practices, material testing and field surveying. At the completion of your first year, you will have the option to transfer to the Civil Engineering Technology program (requires a grade of C or better in Strength of Materials and GPA of 2.5). This program offers workplace integrated learning available to students starting semester one in September and completing subsequent, second semester in April.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course, Mathematics: Grade 12 C or U, or Grade 11 Functions (MCR3U), or equivalent course"
  },
  {
    "name": "Civil Engineering Technology",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,690",
    "url": "https://www.senecacollege.ca/programs/fulltime/CVT.html",
    "duration": "6 Semesters (3 Years)",
    "phone": "(416)-493-4144",
    "description": "If you are dreaming of participating in the design and creation of the built environment, then this program is for you. In this three-year advanced diploma program, you will study principles of highway, municipal and building design, geotechniques, soil mechanics, building code and develop skills in materials testing and surveying. You will also learn to use many computer software packages such as AutoCAD, MicroSurvey, Civil 3D, ArcGIS and other advanced software packages specific to specializations in building, municipal or transportation. By the end of your program you will work independently and in teams on capstone projects and technical reports which will reflect the culmination of several skills acquired by you during the program.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course, Mathematics: Grade 12 C or U, or Grade 11 Functions (MCR3U), or equivalent course"
  },
  {
    "name": "Civil Engineering Technology (For Applicants Currently Attending York University)",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,690",
    "url": "https://www.senecacollege.ca/programs/fulltime/CVTY.html",
    "duration": "6 Semesters (3 Years)",
    "phone": "(416)-493-4144",
    "description": "In this three-year Seneca and York University dual credential program, you will study principles of highway design, municipal and building design, geotechniques and soil mechanics and building codes. Your learning will include developing skills in materials testing and surveying. You will also learn to use many computer software packages such as AutoCAD, MicroSurvey, Civil 3D, ArcGIS and other advanced software packages specific to specializations in building, municipal or transportation. York University students who are currently attending their third year of an Honours Bachelor of Environmental Science will be able to join Seneca in September and complete the three-year Civil Engineering Technology program in five consecutive semesters. This program will provide you with a unique opportunity to earn an advanced college diploma and university honours degree in just five years.",
    "requiredIelts": {},
    "requirements": "Completion of three years of a BA in Environmental Studies at York University. Permission to enrol from York academic adviser"
  },
  {
    "name": "Mechanical Engineering Technology - Building Sciences",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,690",
    "url": "https://www.senecacollege.ca/programs/fulltime/MBT.html#pre-content_menu",
    "duration": "6 Semesters (3 Years)",
    "phone": "(416)-493-4144",
    "description": "Mitigating climate change has become imperative in many industries, including the building sector. This program will prepare you to become an expert in managing environmentally responsible systems for various types of properties. After three years of study, you’ll obtain an advanced diploma and be able to examine, implement and manage a building's energy system, both traditional and renewable, with a focus on sustainability and efficiency. You’ll also have the opportunity to take part in an optional co-op work term to gain real-world experience prior to your career. Students who begin their studies in January are not eligible for co-op, and are required to begin their second semester immediately after the first semester.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course, Mathematics: Grade 12 C or U, or Grade 11 Functions (MCR3U), or equivalent course"
  },
  {
    "name": "Project Management - Environmental",
    "campus": "Newnham, Seneca International Academy",
    "email": "admissions@senecacollege.ca",
    "tuition": "$7,289",
    "url": "https://www.senecacollege.ca/programs/fulltime/PME.html",
    "duration": "2 Semesters (8 Months)",
    "phone": "(416)-493-4144",
    "description": "This eight-month graduate certificate program prepares you for careers in project development and management in both environmental and civil engineering industries. Your studies will encompass all aspects of project management, from the competitive bid process to scheduling, risk management and the closing of projects. During the second semester, you will gain valuable industry experience under the guidance of a mentor.",
    "requiredIelts": {},
    "requirements": "Ontario university or college degree or equivalent in environmental studies, planning, general science, environmental science, earth sciences or life sciences. Applicants with an Ontario college three-year diploma in environmental or engineering technology and a minimum of three years of work experience will be considered for admission. A relevant resumé and references must be provided. English proficiency for graduate certificates "
  },
  {
    "name": "Fire Protection Engineering Technician",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,690",
    "url": "https://www.senecacollege.ca/programs/fulltime/FPN.html",
    "duration": "4 Semesters (2 Years)",
    "phone": "(416)-493-4144",
    "description": "Seneca’s Fire Protection Engineering Technician two-year diploma program is a North American standard in providing comprehensive fire prevention education. You can expect to work with advanced equipment under the guidance of professors and industry experts in fire science labs.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course, Mathematics: Grade 12 C or U, or Grade 11 Functions (MCR3U), or equivalent course"
  },
  {
    "name": "Fire Protection Engineering Technology",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,690",
    "url": "https://www.senecacollege.ca/programs/fulltime/FPT/costs.html#pre-content_menu",
    "duration": "6 Semesters (3 Years)",
    "phone": "(416)-493-4144",
    "description": "Seneca's Fire Protection Engineering Technology (FPT) advanced diploma program, is the leading North American program for fire prevention education. Under the guidance of professors and industry experts, you will work with advanced fire protection equipment. Expect hands-on experience in the design and installation of fire protection systems. Major areas of study include the advanced design and installation of fire protection systems (sprinklers and alarms), leading-edge computer software systems, the governing codes and standards, as well as optional training in fire investigation, insurance and wildland fire suppression. Once you complete the FPT program, you can move forward to the Firefighting Pre–Service Education & Training (FFP) program for a career in firefighting.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course, Mathematics: Grade 12 C or U, or Grade 11 Functions (MCR3U), or equivalent course"
  },
  {
    "name": "Electromechanical Engineering Technology - Automation",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,690",
    "url": "https://www.senecacollege.ca/programs/fulltime/EMA.html",
    "duration": "6 Semesters (3 Years)",
    "phone": "(416)-493-4144",
    "description": "In this three-year advanced diploma program, you will learn how to interpret schematic drawings, and use electrical and mechanical diagnostic tools. With an emphasis on automation and robotics, this program is a blend of electronics and mechanical engineering and focuses on training engineering technologists. You will acquire industry specific skills such as operating hydraulic and pneumatic machineries, using programmable logic controllers (PLC), and understanding machine elements and industrial automation. Classes and labs will be delivered in Seneca’s Centre for Innovation, Technology and Entrepreneurship (CITE).",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD) or equivalent with: Grade 12 English: ENG4(C) or ENG4(U), Grade 12 Mathematics: (C) or (U) OR Mature Student Status (age 19 or older) with the above prerequisite course(s), or their equivalent(s)."
  },
  {
    "name": "Electronics Engineering Technician",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,690",
    "url": "https://www.senecacollege.ca/programs/fulltime/EEN.html",
    "duration": "4 Semesters (2 Years)",
    "phone": "(416)-493-4144",
    "description": "In this two-year diploma program, you will learn the fundamentals of digital and analog electronics, combined with a foundation in computer technology. This program provides relevant hands—on laboratory work to give you the practical experience, as well as theoretical knowledge of electronic devices, computer programming and diagnostic techniques that the electronics industry values.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course, Mathematics: Grade 12 C or U, or Grade 11 Functions (MCR3U), or equivalent course"
  },
  {
    "name": "Electronics Engineering Technology",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,690",
    "url": "https://www.senecacollege.ca/programs/fulltime/EET.html#pre-content_menu",
    "duration": "6 Semesters (3 Years)",
    "phone": "(416)-493-4144",
    "description": "This three-year advanced diploma program introduces you to a broad background in analog and digital electronics, software development, modern communications and control systems. Topics covered include electronic circuitry, diagnostic techniques, microcontrollers, process control and computer systems and networks, along with digital communications, control systems and mechatronics. During the final year, you will focus on applying the principles you have learned to design and testing electronic projects.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course, Mathematics: Grade 12 C or U, or Grade 11 Functions (MCR3U), or equivalent course"
  },
  {
    "name": "Cosmetic Techniques and Management",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,690",
    "url": "https://www.senecacollege.ca/programs/fulltime/CTM.html",
    "duration": "4 Semesters (2 Years)",
    "phone": "(416)-493-4144",
    "description": "The two-year Cosmetic Techniques and Management diploma program will immerse you in a thriving industry with skills and knowledge that employers and clients value. From practical makeup techniques and skin care analysis skills to marketing and management knowledge, you will learn various aspects of the cosmetic business and develop your talents as an artist. This program offers a fall term start and a winter term start with different delivery options.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course, Canadian citizens and permanent residents may satisfy the English requirement for this program through successful Seneca pre-admission testing."
  },
  {
    "name": "Esthetician",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,690",
    "url": "https://www.senecacollege.ca/programs/fulltime/EST.html",
    "duration": "4 Semesters (2 Years)",
    "phone": "(416)-493-4144",
    "description": "This two-year diploma program has been leading the field in esthetician training for more than 20 years. You will learn about and master facials, manicures, pedicures, body treatments and waxing, ensuring your ability to assist all clients with their personal skin care concerns. Your studies will allow you to practice advanced esthetic treatments including microdermabrasion, light therapies and various anti-aging treatments. As you learn to address skin care concerns, and the nuances of business and customer interaction, you will become a confident and knowledgeable professional.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course. Canadian citizens and permanent residents may satisfy the English and/or mathematics requirements for this program through successful Seneca pre-admission testing."
  },
  {
    "name": "Esthetics and Spa Therapies",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,690",
    "url": "https://www.senecacollege.ca/programs/fulltime/EAS.html",
    "duration": "6 Semesters (3 Years)",
    "phone": "(416)-493-4144",
    "description": "A leader in esthetics since 1990, Seneca’s Esthetics and Spa Therapies program will immerse you in education and training within our on-campus spa that will provide you with hands-on experiences. You can look forward to specializing your focus on advanced services and therapies offered in the spa and medi-spa environments to earn the globally recognized designation of CIDESCO Esthetician.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course"
  },
  {
    "name": "Fashion Arts",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,690",
    "url": "https://www.senecacollege.ca/programs/fulltime/FAA.html",
    "duration": "6 Semesters (3 Years)",
    "phone": "(416)-493-4144",
    "description": "This three-year advanced program allows you to explore your creative potential as you learn in-depth design research, craftsmanship, and industry-oriented production skills for your profession in the fashion industry. Seneca offers exciting courses in applied textiles, knitwear design, fashion history, computer-aided design and production. Our Fashion Resource Centre – a unique collection of Canadian-worn garments and accessories — provides hands-on experience with our amazing fashion heritage.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course"
  },
  {
    "name": "Fashion Business",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,690",
    "url": "https://www.senecacollege.ca/programs/fulltime/FAB.html",
    "duration": "4 Semesters (2 Years)",
    "phone": "(416)-493-4144",
    "description": "The two-year Fashion Business diploma program will prepare you to enter the exciting field of fashion and retail. The courses will be delivered in a mixed mode of lab-based activities as well as theory-based formats that include guest lectures from the industry. From fashion product development, business communications, fashion buying to trend forecasting, you will dive into various specialized areas of the industry.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course, Mathematics: Grade 12 C or U, or Grade 11 U or M, or equivalent course"
  },
  {
    "name": "Fashion Business Management",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$",
    "url": "https://www.senecacollege.ca/programs/fulltime/FBM.html",
    "duration": "6 Semesters (3 Years)",
    "phone": "(416)-493-4144",
    "description": "This three-year advanced diploma program will prepare you to enter the exciting field of fashion and retail. Your studies will range from fashion product development, ethical sourcing, and applications of creative software, marketing communication, social media, fashion textiles and trend forecasting. As a part of your curriculum, you will gain hands-on experience when you participate in the Fashion Industry Exchange and Leadership Development (FIELD) Capstone project where students team up with a fashion industry partner who challenges them to assist with a business dilemma or opportunity.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course, Mathematics: Grade 12 C or U, or Grade 11 U or M, or equivalent course"
  },
  {
    "name": "Fashion Studies",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,690",
    "url": "https://www.senecacollege.ca/programs/fulltime/FST.html",
    "duration": "2 Semesters (8 Months)",
    "phone": "(416)-493-4144",
    "description": "Seneca’s one-year Fashion Studies certificate program will introduce you to fashion design and fashion business that will inspire you to explore creative skills and design applications. You will immerse yourself in design, production, business and communication, including social media. From visual culture, trend forecasting to sustainable fashion, your studies will teach you to investigate the range of experiences offered to professionals in the industry. Furthermore, upon completing this program, you will be able to make an informed decision about continuing your studies in other fashion programs within Seneca’s School of Fashion.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course"
  },
  {
    "name": "Visual Merchandising Arts",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,690",
    "url": "https://www.senecacollege.ca/programs/fulltime/VMA/costs.html#pre-content_menu",
    "duration": "4 Semesters (2 Years)",
    "phone": "(416)-493-4144",
    "description": "Are you creative? Passionate about design? A visual storyteller who can bring a brand to life? This two-year program will prepare you to become a visual merchandiser who can expertly style a brand’s image with mannequins, merchandise, pop-up locations, window displays and store fronts. You’ll express your innovative ideas using design-based software programs, and get hands-on experience working with luxury retail partners such as Nordstrom, Saks Fifth Avenue, Holt Renfrew and Harry Rosen.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course"
  },
  {
    "name": "Veterinary Assistant",
    "campus": "King",
    "email": "admissions@senecacollege.ca",
    "tuition": "$4,692",
    "url": "https://www.senecacollege.ca/programs/fulltime/VTA.html",
    "duration": "2 Semesters (8 Months)",
    "phone": "(416)-493-4144",
    "description": "Throughout this eight-month certificate program, you will gain the essential skills needed to effectively assist veterinary professionals in the practice of veterinary science. To prepare you for a career as a veterinary assistant, you will be provided with a variety of basic laboratory skills and techniques to diagnose and treat domestic animals.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant, English: Grade 12 C or U, or equivalent course, Biology: Grade 11 C or U, or equivalent course. Canadian citizens and permanent residents may satisfy the English and/or mathematics requirements for this program through successful Seneca pre-admission testing. Recommended upgrading for applicants who do not meet academic subject requirements"
  },
  {
    "name": "Veterinary Technician",
    "campus": "King",
    "email": "admissions@senecacollege.ca",
    "tuition": "$4,442",
    "url": "https://www.senecacollege.ca/programs/fulltime/VTE.html",
    "duration": "4 Semesters (2 Years)",
    "phone": "(416)-493-4144",
    "description": "Throughout this two-year diploma program you will gain the knowledge and skills to assist and support veterinary practitioners, public health officers and biomedical research scientists. You will study a variety of subjects, including nutrition, clinical pathology, microbiology, radiography, anatomy, physiology and genetics. These studies will provide you with a strong grasp on animal behaviour, nursing and care. To practice in Ontario as a Registered Veterinary Technician, you must meet and maintain the qualifications set by the Ontario Association of Veterinary Technicians. You must also complete the Veterinary Technician Examination.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course. Mathematics: Grade 12 C or U, or Grade 11 U or M, or equivalent course. Biology: Grade 11 C or U, or equivalent course. Chemistry: Grade 12 C or Grade 11 U, or equivalent course, online applicant profile that details related education, experience and volunteer involvement"
  },
  {
    "name": "Fitness and Health Promotion",
    "campus": "King",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,721",
    "url": "https://www.senecacollege.ca/programs/fulltime/FHP.html#pre-content_menu",
    "duration": "4 Semesters (2 Years)",
    "phone": "(416)-493-4144",
    "description": "In this two-year diploma program you will gain the skills and knowledge required for improving the health of clients and communities through physical fitness. As a student of this program, you will learn about the science and professional practices of implementing fitness and health programs for clients of all ages. You will receive advanced training and practical experience in coaching and fitness promotion related to the design and delivery of programs of physical activity and wellness. After this program, you will be well-prepared for the rapidly expanding professional opportunities in fitness, wellness and health promotion.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course. Biology: Grade 11 C or U, or Exercise Science Grade 12 U, or Kinesiology Grade 12 U, or equivalent course"
  },

  {
    "name": "Honours Bachelor of Therapeutic Recreation",
    "campus": "King",
    "email": "admissions@senecacollege.ca",
    "tuition": "$6,696",
    "url": "https://www.senecacollege.ca/programs/fulltime/DTR.html",
    "duration": "8 Semesters (4 Years)",
    "phone": "(416)-493-4144",
    "description": "In this four-year degree program, you will learn to assess, design, evaluate and implement therapeutic interventions for future clients. Therapeutic interventions are activities designed to achieve outcomes in the physical, psychological, social, cognitive and spiritual domains. As a student of this program, you will gain essential knowledge and expertise in various health disciplines such as health sciences, recreation, physiotherapy, occupational therapy and psychology. In semesters six and eight, you will have the opportunity to select professional stream options to increase your knowledge in a specialized area and gain an added advantage in the workplace.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD) or equivalent, including six Grade 12 U or M courses with a minimum overall average of 65%, or a mature applicant (21 years or older). Required courses with minimum final grade of  65% in each: English: Grade 12 ENG4U"
  },
  {
    "name": "Recreation and Leisure Services",
    "campus": "King",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,721",
    "url": "https://www.senecacollege.ca/programs/fulltime/RLS.html",
    "duration": "4 Semesters (2 Years)",
    "phone": "(416)-493-4144",
    "description": "This two-year diploma program prepares you to deliver exciting recreational activities that help local communities, public and private organizations, and groups such as older adults, youth, and persons with disabilities. With exposure to key professional practices, such as physical literacy, leadership and management, business skills, facilities management, community development and program development, you will be well prepared to develop programs and activities for municipalities, not-for-profit groups, and private organizations. Graduates from this program are eligible for transfer credits into the Bachelors of Therapeutic Recreation degree. This program offers significant credit transfers that allow you to earn this four-year degree within three years.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course"
  },
  {
    "name": "Honours Bachelor of Healthcare Management",
    "campus": "King",
    "email": "admissions@senecacollege.ca",
    "tuition": "$6,696",
    "url": "https://www.senecacollege.ca/programs/fulltime/BHM.html",
    "duration": "8 Semesters (4 Years)",
    "phone": "(416)-493-4144",
    "description": "This program is the first in Canada to be designed around the Canadian College of Health Leaders LEADS Leadership Framework and will provide you with the integrative thinking skills which are critical to the management of complex health systems. The training from this program will prepare you to tackle the needs and priorities for financial sustainability, evidence-informed decision making, health promotion, illness prevention, modern management and patient-centred care as outlined by the Conference Board of The Canada Health Summit.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD) or equivalent, including six Grade 12 U or M courses with a minimum overall average of 65%, or a mature applicant (21 years or older). Required courses with minimum final grade of  65% in each: English: Grade 12 ENG4U. Mathematic: any Grade 12 U"
  },
  {
    "name": "Office Administration - Health Services",
    "campus": "Seneca@York",
    "email": "admissions@senecacollege.ca",
    "tuition": "6,691",
    "url": "https://www.senecacollege.ca/programs/fulltime/MES.html",
    "duration": "3 Semesters (12 Months)",
    "phone": "(416)-493-4144",
    "description": "This twelve-month diploma program gives you the opportunity to develop the specialized skills you need to work in a variety of healthcare settings. Through practical, hands-on training you will acquire a knowledge of computer skills and software, medical terminology, clinical and office procedures, specialized software and medical ethics. In three consecutive semesters, you will acquire the skills and knowledge usually offered in a four-semester program. This will allow you to complete the program and access the job market at non-traditional times. Fluency in English is critical to your success in the program and medical environment. There is a strong focus on communicating effectively from the beginning of the program to graduation.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course"
  },
  {
    "name": "Nursing (Collaborative with York University)",
    "campus": "King",
    "email": "admissions@senecacollege.ca",
    "tuition": "7,129",
    "url": "https://www.senecacollege.ca/programs/fulltime/BSCN.html",
    "duration": "8 Semesters (4 Years)",
    "phone": "(416)-493-4144",
    "description": "In this four-year degree program, you will gain a solid foundation in human anatomy, physiology and complementary subjects in general education, as well as a minimum of 1,200 hours of clinical experience. Your studies will include nursing theory, nursing practice, professional issues, human anatomy, physiology, pathophysiology, psychology and General Education. To improve your likelihood of success while studying in BSCN, we recommend limiting employment to less than eight hours per week.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma or equivalent including six Grade 12 U or M courses with minimum grade of 70% and minimum average of 80%. OR Mature applicant (20 years or older by the end of the calendar year of admission and has been out of high school for a minimum of two years) with a final grade of 70% and minimum four course average of 80% (must have completed any required math or science courses within the last five years). Required courses - minimum final grade of 70% in each: English: Grade 12 ENG 4(U). Mathematics: any Grade 12(U) . Biology: Grade 12 SBI 4(U). Chemistry: Grade 12 SCH 4(U) or Physics: Grade 12 SPH 4(U)"
  },
  {
    "name": "Opticianry",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$7,247",
    "url": "https://www.senecacollege.ca/programs/fulltime/OPTC.html",
    "duration": "4 Semesters (2 Years)",
    "phone": "(416)-493-4144",
    "description": "In this two-year diploma program, you will acquire the specialized knowledge and skills required to safely and competently dispense subnormal vision devices, contact lenses and eyeglasses. You will also learn the basic science of sight and optics and develop practical spectacle fabrication and dispensing skills.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course. Mathematics: Grade 12 C or U, or equivalent course. Science: Grade 12 C or U chemistry or physics, or Grade 11 C or U biology, or an equivalent course"
  },
  {
    "name": "Personal Support Worker",
    "campus": "King, Yorkgate",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,721",
    "url": "https://www.senecacollege.ca/programs/fulltime/PSWC.html",
    "duration": "2 Semesters (1 Year)",
    "phone": "(416)-493-4144",
    "description": "This one-year certificate program is designed to teach you how to effectively provide care and assistance to clients and families in order to live fulfilling lives in their communities and in institutions. As a student of this program, you will develop a broad range of abilities emphasizing value, true sensitivity and respect for the individuality of each client. You will also have the opportunity to participate in cross disciplinary and/or inter-professional learning opportunities with other members of the care and service team for example, Practical Nursing, Registered Nursing and Social Service Workers.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. Must be able to understand English at an academic level"
  },
  {
    "name": "Practical Nursing",
    "campus": "King, Yorkgate",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,721",
    "url": "https://www.senecacollege.ca/programs/fulltime/PND.html",
    "duration": "5 Semesters (2 Years)",
    "phone": "(416)-493-4144",
    "description": "In this two-year diploma program, you will be working with experienced faculty to gain the knowledge, skills and judgment required for competent clinical nursing practice. You will study anatomy, physiology, English, as well as psychology which will prepare you to write the Canadian Practical Nurse Registration Examination. In addition, you will participate in a variety of learning modalities, online interactive learning, collaborative group learning, simulation experiences and direct nursing care in a variety of healthcare settings.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. A minimum grade of 70% is required in each of the following: English: Grade 12 C or U, or equivalent course. Mathematics: Grade 12 C or U, or Grade 11 U or M, or equivalent course. Biology: Grade 11 C or U, or equivalent course. Physics or Chemistry: Grade 12 C or U, or equivalent course"
  },
  {
    "name": "Pre-Health Sciences Pathway to Advanced Diplomas and Degrees",
    "campus": "King",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,721",
    "url": "https://www.senecacollege.ca/programs/fulltime/PHS.html",
    "duration": "2 Semesters (1 Year)",
    "phone": "(416)-493-4144",
    "description": "This one-year certificate program is designed to provide you with the core knowledge, skills and abilities fundamental to academic success in health sciences and other high affinity programs. You will develop knowledge and skills in communications, mathematics, human anatomy, biology, and organic/inorganic chemistry. You will be well prepared to further your study in the health sciences at either the diploma or baccalaureate level. The program also provides you with the opportunity to learn about potential careers in the health sciences, and to identify other programs focusing on the biological or chemical sciences that will enable you to achieve your career objectives.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course. Mathematics: Grade 12 C or U, or equivalent course"
  },
  {
    "name": "Workplace Safety and Prevention",
    "campus": "King",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,721",
    "url": "https://www.senecacollege.ca/programs/fulltime/WSP.html",
    "duration": "4 Semesters (2 Years)",
    "phone": "(416)-493-4144",
    "description": "This two-year diploma program is the first of its kind in the GTA. It is uniquely designed to meet the growing need for enhanced workplace health and safety in every industry. You will develop strong foundational knowledge in health and safety to identify, manage and assess risks in various workplace settings. This program will also focus on the policies and procedures in the care and prevention practice. You will apply concepts and theories with practical experience in field placements and graduate with the skills needed to identify and report on safety and health conditions in the workplace.   ",
    "requiredIelts": {},
    "requirements": "Grade 12 English: ENG4(C) or ENG4(U). Grade 11 or 12 Chemistry: (C) or (U); or Grade 11 or 12 Biology (C) or (U) (both recommended, only one is required) or appropriate Academic and Career Entrance (ACE) Certificate program credits (see Academic Upgrading)."
  },
  {
    "name": "Global Hospitality Business Development",
    "campus": "Newham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$5,436",
    "url": "https://www.senecacollege.ca/programs/fulltime/GBD.html",
    "duration": "2 Semesters (8 Months)",
    "phone": "(416)-493-4144",
    "description": "This eight-month graduate certificate program will help you discover the world of opportunity in the multibillion-dollar hospitality and tourism industry. As this sector is constantly innovating and growing, there is a greater need for globally-minded professionals with business management skills. This program will position you to be a sought-after professional in one of the most service-driven industries in the world. ",
    "requiredIelts": {},
    "requirements": "Ontario university or college degree or college diploma or equivalent. Applicants with an equivalent combination of partial postsecondary and/or three to five years related work experience may be considered for admission. A relevant resumé and references must be provided. . English proficiency for graduate certificates "
  },
  {
    "name": "Global Hospitality Operations Management",
    "campus": "Newham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$5,436",
    "url": "https://www.senecacollege.ca/programs/fulltime/GOM.html",
    "duration": "2 Semesters (8 Months)",
    "phone": "(416)-493-4144",
    "description": "With this eight-month graduate certificate program, you will discover a world of opportunity in this multibillion-dollar hospitality industry that is fuelled by the delivery of outstanding service. Learn all you need to know about the business of hospitality and tourism, gain an understanding of key business practices in operations management, revenue management and marketing techniques.",
    "requiredIelts": {},
    "requirements": "Ontario university or college degree or college diploma or equivalent. Applicants with an equivalent combination of partial postsecondary and/or three to five years related work experience may be considered for admission. A relevant resumé and references must be provided. . English proficiency for graduate certificates "
  },
  {
    "name": "Global Hospitality Services Leadership",
    "campus": "Newham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$5,436",
    "url": "https://www.senecacollege.ca/programs/fulltime/GSL.html",
    "duration": "2 Semesters (8 Months)",
    "phone": "(416)-493-4144",
    "description": "This eight-month graduate certificate program is designed to provide you with leadership skills to support the global hospitality service economy. You will be able to respond to the shift in global economic and business management practices from product to service. An emphasis is placed on recognizing new opportunities and developing new service categories and market segments while supporting the implementation of organizational change. ",
    "requiredIelts": {},
    "requirements": "Ontario university or college degree or college diploma or equivalent. Applicants with an equivalent combination of partial postsecondary and/or three to five years related work experience may be considered for admission. A relevant resumé and references must be provided.. English proficiency for graduate certificates"
  },
  {
    "name": "Hospitality - Hotel and Restaurant Services Management",
    "campus": "Newham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,503",
    "url": "https://www.senecacollege.ca/programs/fulltime/HTM.html",
    "duration": "4 Semesters (2 Years)",
    "phone": "(416)-493-4144",
    "description": "This two-year diploma program is designed to prepare you for a career in the vibrant global hotel and hospitality industry. Not only will you work closely with your peers and professors who are industry professionals, but you will learn and practise through paid work experience key skills employers are seeking, including exceptional guest service, industry standard software applications, cultural diversity and management skills. As you begin your studies with a common first semester, you can specialize in hotel and restaurant service or wedding and conference planning. Throughout the program, you will earn industry-recognized certifications that are built into the coursework to enhance your resumé, ensuring you graduate job-ready.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course. Mathematics: Grade 12 C or U, or Grade 11 C or U, or equivalent course"
  },
  {
    "name": "Hospitality Foundations",
    "campus": "Newham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,503",
    "url": "https://www.senecacollege.ca/programs/fulltime/HFC.html",
    "duration": "2 Semesters (8 Months)",
    "phone": "(416)-493-4144",
    "description": "This eight-month certificate program will prepare you to enter a wide range of employment opportunities within the thriving hospitality industry. You will develop skills and knowledge in the core areas of hospitality industry, such as food preparation, service leadership, food safety and sanitation, food theory and practice, guest services and customer relations, and dining room service. Throughout the program, you will also earn industry-recognized certifications that are built into coursework to enhance your resumé, ensuring you graduate job-ready.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course"
  },
  {
    "name": "Flight Services",
    "campus": "Newham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,503",
    "url": "https://www.senecacollege.ca/programs/fulltime/FLS.html",
    "duration": "2 Semesters (8 Months)",
    "phone": "(416)-493-4144",
    "description": "This eight-month Flight Services certificate program is offered in co-operation with major airlines giving you a competitive edge in the airline service industry. You will develop the knowledge, skills and behaviour required to explore a rewarding career in the service-driven aviation industry. You will learn to perform a variety of functions, aircraft safety procedures and essential techniques to deliver exceptional passenger experience.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course"
  },
  {
    "name": "Flight Services: Operations and Cabin Management",
    "campus": "Newham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$4,450",
    "url": "https://www.senecacollege.ca/programs/fulltime/FSO.html",
    "duration": "4 Semesters (2 Years)",
    "phone": "(416)-493-4144",
    "description": "Transform yourself from an enthusiastic beginner into a skilled, career-ready professional, prepared to meet the standards of employers throughout the flight services industry. This exclusive two-year diploma program is designed to help you develop job-related skills and knowledge in an experiential learning setting preparing you to perform a variety of functions required by the airline industry.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course"
  },
  {
    "name": "Tourism - Services Management - Global Tourism Business Specialization ",
    "campus": "Newham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,503",
    "url": "https://www.senecacollege.ca/programs/fulltime/GTB.html",
    "duration": "4 Semesters (2 Years)",
    "phone": "(416)-493-4144",
    "description": "The tourism sector is a large economic growth contributor in Ontario, Canada and the world. This two-year diploma program will help you establish a service-driven attitude and develop your business and entrepreneurial skills to create, promote and sell global tourism products and services. You will graduate as a specialist in tourism destination innovation and implementing exciting new tourism services.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD) or equivalent with Grade 12 English: ENG4(C) or ENG4(U)"
  },
  {
    "name": "Tourism - Services Management - Travel Services Specialization",
    "campus": "Newham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,503",
    "url": "https://www.senecacollege.ca/programs/fulltime/TIS.html",
    "duration": "4 Semesters (2 Years)",
    "phone": "(416)-493-4144",
    "description": "This two-year diploma program is designed to provide a solid foundation of the skills and knowledge required to work in the corporate travel business, leisure, or cruise travel sectors. In this program, you will understand the tourism industry as a business with an emphasis on developing a service-driven attitude and honing business skills in marketing, sales and customer relations.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course"
  },
  {
    "name": "Tourism - Travel Operations",
    "campus": "Newham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,503",
    "url": "https://www.senecacollege.ca/programs/fulltime/TTO.html#pre-content_menu",
    "duration": "2 Semesters (8 Months)",
    "phone": "(416)-493-4144",
    "description": "This eight-month certificate program is designed to develop your skills and knowledge appropriate for an entry-level position in the tourism industry. In this program, you will learn to proactively promote tourism products and services, improve the quality of customer experience, and understand North American tourism destinations. ",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course"
  },
  {
    "name": "Computer Engineering Technology",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,690",
    "url": "https://www.senecacollege.ca/programs/fulltime/ECT.html",
    "duration": "6 Semesters (3 Years)",
    "phone": "(416)-493-4144",
    "description": "Through this intensive three-year advanced diploma program, you will gain a solid foundation, combining the three primary branches of information and communications technology: electronics, software development and IT infrastructure. Seneca incorporates curriculum content from a number of internationally known organizations, including CompTIA and Cisco. In addition, your professors have strong ties with major tech companies, including Microsoft, Bell, Rogers, Keysight Technologies and Freescale Semiconductors, to help you gain exposure to current industry practices and build a network prior to graduation. As a graduate of this program, your knowledge of both relevant equipment and its use will enhance your career opportunities in the computer and information technology fields.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course. Mathematics: Grade 12 C or U, or Grade 11 Functions (MCR3U), or equivalent course"
  },
  {
    "name": "Computer Networking and Technical Support",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,928",
    "url": "https://www.senecacollege.ca/programs/fulltime/CNS.html",
    "duration": "4 Semesters (2 Years)",
    "phone": "(416)-493-4144",
    "description": "This two-year diploma program provides you with the knowledge and technical skills for leadership in the networking industry.  In our on-campus labs, you will receive practical hands-on training in computer hardware, applied Internet technology, system diagnostics, local area network installation and data communication techniques.  This program is built on partnerships with some of the most influential names in networking today, Cisco, IBM, Microsoft, Rogers and Sun, giving you an edge in the industry. The program curriculum prepares students to specialize in system administration, network administration, security, and physical and logical network design.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course. Mathematics: Grade 12 C or U, or Grade 11 U or M, or equivalent course"
  },
  {
    "name": "Computer Programmer",
    "campus": "Newnham, Seneca International Academy",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,690",
    "url": "https://www.senecacollege.ca/programs/fulltime/CPD.html",
    "duration": "4 Semesters (2 Years)",
    "phone": "(416)-493-4144",
    "description": "This two-year diploma program prepares you with the skills and knowledge to begin your career as a programmer. As a leader in developing relevant programs, we have the largest offering of computer studies programs in the province. Through a variety of practical and theoretical courses, you will gain skills in mobile development, web development and distributed programming techniques and database administration. You will also learn about security and a variety of operating systems including Windows, UNIX, Linux and IBM Business Computing. Graduates of this program will enter their industry with programming and communications skills suitable for employment.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course. Mathematics: Grade 12 C or U, or Grade 11 U or M, or equivalent course"
  },
  {
    "name": "Computer Programming and Analysis",
    "campus": "Newnham, Seneca International Academy",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,690",
    "url": "https://www.senecacollege.ca/programs/fulltime/CPA.html",
    "duration": "6 Semesters (3 Years)",
    "phone": "(416)-493-4144",
    "description": "This three-year advanced diploma program provides you with the skills and knowledge to begin your career as a software developer. You will learn programming languages, program design and system analysis. Web concepts are integrated into all courses to develop active database web programs on a variety of operating systems. Advanced techniques are taught through professional option courses. ",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course. Mathematics: Grade 12 C or U, or Grade 11 U or M, or equivalent course"
  },
  {
    "name": "Computer Systems Technology",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,928",
    "url": "https://www.senecacollege.ca/programs/fulltime/CTY.html",
    "duration": "6 Semesters (3 Years)",
    "phone": "(416)-493-4144",
    "description": "This three-year advanced diploma program provides you with knowledge and technical skills in networking and computer system administration. Built on partnerships with industry experts like Cisco, IBM, and Microsoft, our curriculum prepares students to specialize in security, physical and logical network design, as well as enterprise management. This program is comprised of practical courses focusing on hands-on training with computer programs in specialty labs.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant.  English: Grade 12 C or U, or equivalent course. Mathematics: Grade 12 C or U, or Grade 11 U or M, or equivalent course"
  },
  {
    "name": "Cybersecurity and Threat Management",
    "campus": "Newnham, Seneca Downtown, Hybrid Delivery",
    "email": "admissions@senecacollege.ca",
    "tuition": "$7,472",
    "url": "https://www.senecacollege.ca/programs/fulltime/CYT.html#pre-content_menu",
    "duration": "2 Semesters (8 Months)",
    "phone": "(416)-493-4144",
    "description": "As digital innovation continues to rapidly advance, it is becoming increasingly difficult for organizations to keep up with the changing nature of cybersecurity threats. With a shortage of cybersecurity professionals across Canada, this program was designed and developed with leading financial services organizations to meet the need for individuals with the specialized skills to secure, protect and defend mobile and network infrastructures, preventing fraud, data breaches and other vulnerabilities. As a graduate of this eight-month Cybersecurity and Threat Management program, you will be equipped with cutting-edge best practices and skills in communication, information security, project management, problem-solving and more. The industry capstone project and optional work term will give you hands-on experience and position you for a career in one of the world’s fastest-growing fields.",
    "requiredIelts": {},
    "requirements": "Ontario university/college degree, college diploma, advanced diploma or equivalent in an area of Information Technology: computer engineering, software, hardware, networking or a related discipline."
  },
  {
    "name": "Database Application Developer",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$8,111",
    "url": "https://www.senecacollege.ca/programs/fulltime/DAD.html",
    "duration": "2 Semesters (1 Year)",
    "phone": "(416)-493-4144",
    "description": "This one-year graduate certificate will teach you how to design, test and implement databases on a variety of operating platforms. You will also learn how to create database computer applications using web and object-oriented languages. This program offers an optional work term(s) for those who meet all academic requirements.",
    "requiredIelts": {},
    "requirements": "Ontario university or college degree or college diploma or equivalent in computers. Applicants with a degree or diploma in a non-computer field with two years IT-related work experience (or with completion of IT programming courses) will be considered for admission. Applicants with an equivalent combination of partial postsecondary and/or three to five years of related work experience may be considered for admission. A relevant resumé and references must be provided.  English proficiency for graduate certificates "
  },
  {
    "name": "Honours Bachelor of Commerce - Business Technology Management",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$7,783",
    "url": "https://www.senecacollege.ca/programs/fulltime/BTM.html",
    "duration": "8 Semesters (4 Years)",
    "phone": "(416)-493-4144",
    "description": "This four-year bachelor degree will provide you with information technology (IT), business management and leadership skills which can be applied to a business. Graduates will be prepared for jobs as IT-savvy business professionals who can implement and manage strategies and operate effectively in teams. You will be capable of planning and implementing IT strategies and technologies to achieve a competitive advantage in the industry. This program includes a mandatory work placement that applies theoretical and practical knowledge in a real-world setting.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD) or equivalent, including six Grade 12 U or M courses with a minimum overall average of 65%, or a mature applicant (21 years or older). Required courses with minimum final grade of  65% in each: English: Grade 12 ENG4U. Mathematics: any Grade 12 U"
  },
  {
    "name": "Honours Bachelor of Data Science and Analytics",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$7,478",
    "url": "https://www.senecacollege.ca/programs/fulltime/DSA.html",
    "duration": "8 Semesters (4 Years)",
    "phone": "(416)-493-4144",
    "description": "The Honours Bachelor of Data Science and Analytics program is the first-of-its-kind in Ontario. This four-year degree program was designed to meet the growing need for data-driven business solutions. You will learn to identify and interpret data using algorithms and acquire skills to draw meaningful conclusions. Your knowledge will be enhanced through theory and applied learning with the help of case studies, guest speakers and a co-op work experience. As a graduate of this program, you will be uniquely positioned to make an impact by combining solid business strategies with an in-depth knowledge of computer science, statistics and analytics.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD) or equivalent, including six Grade 12 U or M courses with a minimum overall average of 65%, or a mature applicant (21 years or older). Required courses with minimum final grade of 65% in each: English: Grade 12 ENG4U. Mathematics: any two Grade 12 U (MDM4U and MHF4U are recommended)"
  },
  {
    "name": "Honours Bachelor of Technology - Informatics and Security",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$7,471",
    "url": "https://www.senecacollege.ca/programs/fulltime/IFS.html",
    "duration": "8 Semesters (4 Years)",
    "phone": "(416)-493-4144",
    "description": "In this four-year honours bachelor degree, you will learn the critical knowledge and practical skills required for a successful career in information security. You will develop comprehensive knowledge of vulnerability and threat assessment, risk management, data analysis and network and operating system infrastructure. This program focuses on practical applications that solve a variety of technological threats including hackers, malware and data breaches.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD) or equivalent, including six Grade 12 U or M courses with a minimum overall average of 65%, or a mature applicant (21 years or older). Required courses with minimum final grade of  65% in each: English: Grade 12 ENG4U. Mathematic: any Grade 12 U"
  },
  {
    "name": "Honours Bachelor of Technology - Software Development",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$7,471",
    "url": "https://www.senecacollege.ca/programs/fulltime/BSD.html",
    "duration": "8 Semesters (4 Years)",
    "phone": "(416)-493-4144",
    "description": "This four-year honours bachelor degree will provide you with extensive knowledge and technical skills in software development languages. This program also covers topics in operating systems, web applications, multimedia interfaces, information security, databases, system analysis and design principles. You will also develop communication skills to effectively present technical ideas.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD) or equivalent, including six Grade 12 U or M courses with a minimum overall average of 65%, or a mature applicant (21 years or older). Required courses with minimum final grade of  65% in each: English: Grade 12 ENG4U. Mathematic: any Grade 12 U"
  },
  {
    "name": "Project Management - Information Technology",
    "campus": "Newnham, Seneca International Academy",
    "email": "admissions@senecacollege.ca",
    "tuition": "$7,289",
    "url": "https://www.senecacollege.ca/programs/fulltime/PMC.html",
    "duration": "2 Semesters (8 Months)",
    "phone": "(416)-493-4144",
    "description": "In this eight-month graduate certificate program, you will learn about the advances in project management taking place in the Information Technology (IT) industry. This program teaches an understanding of when to apply methodologies in the IT industry, including when each methodology is appropriate to use. This program will also refine your project management skills by providing an enhanced awareness of IT projects, programs and policies in two consecutive semesters. This program offers an optional work term for students to gain practical experience in the IT sector prior to graduation.",
    "requiredIelts": {},
    "requirements": "Ontario university or college degree, or three-year college diploma or equivalent in software development or IT administration. Applicants with a degree or diploma in IT administration, business or liberal arts with two years IT-related work experience will be considered for admission. A relevant resumé and references must be provided.. English proficiency for graduate certificates "
  },
  {
    "name": "Justice Administration Services",
    "campus": "Seneca@York",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,573",
    "url": "https://www.senecacollege.ca/programs/fulltime/JAS.html",
    "duration": "4 Semesters (2 Years)",
    "phone": "(416)-493-4144",
    "description": "This two-year diploma program will equip you with necessary skills to work in the justice sector, as a professional public service administrator, or clerk for courts or quasi-judicial administrative tribunals. You will study Canadian law, procedure and ethics, and gain hands-on experience in the areas of project management, legal research, public administration and technology. Fluency in English is critical to your success as there is a strong focus on effective written and verbal communication throughout the program. ",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course"
  },
  {
    "name": "Justice Administration Services (Articulated)",
    "campus": "Seneca@York",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,573",
    "url": "https://www.senecacollege.ca/programs/fulltime/JASY.html",
    "duration": "2 Semesters (9 Months)",
    "phone": "(416)-493-4144",
    "description": "This distinct, nine-month articulated program is for you, if you are a graduate of the Law and Society Program of York University or of a Justice Studies degree or equivalent from an Ontario university. You will be equipped with the necessary skills to work in the justice sector, as a professional public service administrator or clerk for courts and quasi-judicial administrative tribunals. You will study Canadian law, procedure and ethics while gaining hands-on experience in the areas of project management, legal research, public administration and technology. Fluency in English is critical to your success as there is a strong focus on effective written and verbal communication throughout the program.",
    "requiredIelts": {},
    "requirements": "Bachelor of Arts – Law and Society at York University, or a degree in justice studies from a Canadian university. Applicants who have partially completed a degree in the appropriate discipline may be considered for admission"
  },
  {
    "name": "Law Clerk",
    "campus": "Seneca@York",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,573",
    "url": "https://www.senecacollege.ca/programs/fulltime/LCK.html",
    "duration": "4 Semesters (2 Years)",
    "phone": "(416)-493-4144",
    "description": "This two-year diploma program will prepare you to work under the supervision of a lawyer in a fast-paced legal environment. In addition to learning about legal principles and ethics, you will obtain practical, hands-on training that will equip you for success in the workplace. The curriculum focuses on real estate, corporate and commercial, litigation, wills and estates, and family law with an emphasis on the technological skills needed in these practice areas.  ",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course"
  },
  {
    "name": "Law Clerk (Accelerated)",
    "campus": "Seneca@York",
    "email": "admissions@senecacollege.ca",
    "tuition": "$5,332",
    "url": "https://www.senecacollege.ca/programs/fulltime/LCKA.html",
    "duration": "3 Semesters (13 Months)",
    "phone": "(416)-493-4144",
    "description": "This is an accelerated version of our Law Clerk program. If you have a previous postsecondary degree or diploma, you will finish this program in 13 months instead of four semesters. The program will prepare you to work under the supervision of a lawyer in a fast-paced legal environment. In addition to learning about legal principles and ethics, you will obtain practical, hands-on training that will equip you for success in the workplace. The curriculum focuses on real estate, corporate and commercial, litigation, wills and estates, and family law, with an emphasis on the technological skills needed in these practice areas.",
    "requiredIelts": {},
    "requirements": "Ontario university or college degree or college diploma, or equivalent Applicants with substantial completion of a degree (75%) may be considered for admission. Three postsecondary general education credits. One postsecondary English credit"
  },
  {
    "name": "Office Administration - Legal",
    "campus": "Seneca@York",
    "email": "admissions@senecacollege.ca",
    "tuition": "$6,691",
    "url": "https://www.senecacollege.ca/programs/fulltime/LES.html",
    "duration": "3 Semesters (12 Months)",
    "phone": "(416)-493-4144",
    "description": "This twelve-month diploma program will enable you to acquire the relevant administrative and technological skills to meet the demands of the current and emerging legal office environment. Through practical, hands-on training you will acquire a knowledge of legal office procedures, document production, specialized legal software, professionalism and ethics. Areas of study include litigation, family, corporate, real estate and estate law.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course"
  },
  {
    "name": "Paralegal",
    "campus": "Seneca@York",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,573",
    "url": "https://www.senecacollege.ca/programs/fulltime/PLE.html",
    "duration": "4 Semesters (2 Years)",
    "phone": "(416)-493-4144",
    "description": "his two-year diploma program prepares you to become a licensed paralegal in accordance with the requirements of the Law Society Act. As a licensed paralegal, you may act in a self–employed capacity and offer specified legal services directly to the public for a fee without the supervision of a lawyer, or you may be a salaried employee in various legal environments. In this program, you will acquire an understanding of the general principles of law and receive theoretical and practical training in specific legal subjects, legal ethics and small business practice. Successful completion of this program qualifies you to write the Law Society of Ontario licensing examination, a requirement if you wish to practise as a paralegal in Ontario.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course"
  },
  {
    "name": "Paralegal (Accelerated)",
    "campus": "Seneca@York",
    "email": "admissions@senecacollege.ca",
    "tuition": "$5,332",
    "url": "https://www.senecacollege.ca/programs/fulltime/PLEA.html",
    "duration": "3 Semesters (13 Months)",
    "phone": "(416)-493-4144",
    "description": "This 13-month diploma program is an accelerated version of our Paralegal program. This program will prepare you to become a licensed paralegal in accordance with the requirements of the Law Society Act. As a licensed paralegal, you may act in a self–employed capacity and offer specified legal services directly to the public for a fee without the supervision of a lawyer, or you may be a salaried employee in various legal environments. In this program, you will acquire an understanding of the general principles of law and receive theoretical and practical training in specific legal subjects, legal ethics and small business practice.  Successful completion of this program qualifies you to write the Law Society of Ontario licensing examination, a requirement if you wish to practise as a paralegal in Ontario.",
    "requiredIelts": {},
    "requirements": "Ontario university or college degree or equivalent, or an Ontario college diploma in a field related to legal, justice or public administration.  Applicants with substantial completion of a degree (75%) may be considered for admission. Three postsecondary general education credits. One postsecondary English credit"
  },
  {
    "name": "Public Administration",
    "campus": "Seneca@York",
    "email": "admissions@senecacollege.ca",
    "tuition": "$4,512",
    "url": "https://www.senecacollege.ca/programs/fulltime/PAD.html",
    "duration": "2 Semesters (8 Months)",
    "phone": "(416)-493-4144",
    "description": "This eight-month graduate certificate program provides you with the multi-disciplinary skills and experience required to be an successful public service employee. The program was developed by municipal government professionals with the goal of providing graduates with the skills to be successful in the public sector. You will receive advanced training in communications, policy analysis, project management, information technology, finance, governance, leadership and human resources management. Delivered in a small class setting, the program benefits from experienced professors who are still active or employed within the public sector.",
    "requiredIelts": {},
    "requirements": "Ontario university or college degree or college diploma or equivalent. Applicants with an equivalent combination of partial postsecondary and/or three to five years related work experience may be considered for admission. A relevant resumé and references must be provided. English proficiency for graduate certificates "
  },
  {
    "name": "Real Property Administration (Assessment and Appraisal)",
    "campus": "Seneca@York",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,573",
    "url": "https://www.senecacollege.ca/programs/fulltime/RPA.html#pre-content_menu",
    "duration": "4 Semesters (2 Years)",
    "phone": "(416)-493-4144",
    "description": "This two-year diploma program is designed to prepare you to become a highly versatile and in-demand professional in the property valuation and property tax sectors. You will acquire in-depth knowledge of property appraisal and property assessment fields, including all aspects of the property assessment system, the assessment appeals process, and property tax calculation and administration. Your learning experience will incorporate leading-edge industry technology, industry-standard techniques, practical experience, and is enhanced by established strategic industry partnerships. This hands-on program offers university-level courses. You will require accountability, responsibility, proficiency in time management, attention to detail, diligence and hard work along with good verbal and written communication skills in order to meet industry-prescribed standards.  The ability to work both independently and as part of a team are also essential to your success in this program.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course. Mathematics: Grade 12 C or U, or Grade 11 U or M, or equivalent course"
  },
  {
    "name": "Real Property Administration (Assessment and Appraisal) (Accelerated)",
    "campus": "Seneca@York",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,573",
    "url": "https://www.senecacollege.ca/programs/fulltime/RPAA.html",
    "duration": "2 Semesters (8 Months)",
    "phone": "(416)-493-4144",
    "description": "Seneca is the only postsecondary institution offering the accelerated Real Property Administration program (Assessment and Appraisal).  In this eight-month diploma program, you will develop expertise in all aspects of property valuation and property tax sectors.  You will advance expertise in all aspects of property valuation – in both the property appraisal and property assessment fields, including all aspects of the property assessment system, the assessment appeals process, and property tax calculation and administration.",
    "requiredIelts": {},
    "requirements": "Ontario university or college degree or college diploma, or equivalent. Applicants with substantial completion of a degree (75%) may be considered for admission. Three postsecondary general education credits. One postsecondary English credit. One postsecondary or senior high school mathematics C, U or M course"
  },
  {
    "name": "911 and Emergency Services Communications",
    "campus": "King",
    "email": "admissions@senecacollege.ca",
    "tuition": "$4,315",
    "url": "https://www.senecacollege.ca/programs/fulltime/ESC.html",
    "duration": "2 Semesters (8 Months)",
    "phone": "(416)-493-4144",
    "description": "This eight-month certificate program will provide you with principles and skills to effectively manage the public and work in emergency services and perform under stressful conditions. An emergency services communicator is often the first person involved in responding to members of the public during times of distress and crisis. Your training will combine professional knowledge and practical scenarios, including utilizing Hexagon’s industry-leading Computer-Aided Dispatch System (I-CAD) system. You will learn how to record and analyze data received from calls, and how this critical information can direct the response to an incident. Upon completion of required hours and professional exams, you will have the opportunity to qualify for the Public Safety Telecommunicator certificate offered by the Association of Public Safety Communications Officials (APCO) and the Mental Health First Aid (MHFA) certification. Graduates of Ontario Police Foundations programs are eligible to receive four courses as credit towards the 12 courses required for the certificate in Emergency Services Communications.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course"
  },
  {
    "name": "Advanced Investigations and Enforcement",
    "campus": "King",
    "email": "admissions@senecacollege.ca",
    "tuition": "$4,263",
    "url": "https://www.senecacollege.ca/programs/fulltime/AIE.html",
    "duration": "2 Semesters (8 Months)",
    "phone": "(416)-493-4144",
    "description": "In this eight-month graduate certificate program, you will receive a combination of academic knowledge and hands-on training to pursue a dynamic career in public and private policing and investigations. With a focus on the development of advanced skills, you will be prepared for the challenges and rewards that come with investigations and law enforcement. After successful completion of the first semester, you can apply for a training completion number. It will make you eligible to be tested, at your own expense, for the provincially regulated licence to be a private investigator. Additionally, by completing the Firearms Safety course, you will be eligible to apply for a Canadian Firearms License.",
    "requiredIelts": {},
    "requirements": "Ontario university or college degree or equivalent in a field related to criminology, psychology, sociology, justice studies, public administration or an Ontario college diploma in police foundations, law and security administration, community justice services or a related area of study. Applicants with an equivalent combination of partial postsecondary and/or three to five years of related work experience may be considered for admission. A relevant resumé and references must be provided. English proficiency for graduate certificates. Canadian citizens or permanent residents educated outside of "
  },
  {
    "name": "Firefighter, Pre-Service Education and Training",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$14,369",
    "url": "https://www.senecacollege.ca/programs/fulltime/FFP.html",
    "duration": "3 Semesters (12 Months)",
    "phone": "(416)-493-4144",
    "description": "This 12-month certificate program offers comprehensive training that meet the National Fire Protection Association (NFPA) qualifications. You will train at several fire training facilities, as well as on campus, to master firefighting skills through hands-on experience. This program offers theoretical knowledge and practical experiences that will prepare you for the highly competitive field of firefighting. You’ll be required to pass a Physical and Endurance Test during the first semester of the program.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course. Mathematics: Grade 12 C or U, or Grade 11 Functions (MCR3U), or equivalent course. Online applicant profile that details work experience, postsecondary education and volunteer involvement"
  },
  {
    "name": "Honours Bachelor of Crime and Intelligence Analysis",
    "campus": "King",
    "email": "admissions@senecacollege.ca",
    "tuition": "$6,696",
    "url": "https://www.senecacollege.ca/programs/fulltime/CIA.html",
    "duration": "8 Semesters (4 Years)",
    "phone": "(416)-493-4144",
    "description": "This is the first crime and intelligence degree offered at an Ontario postsecondary institution which focuses on the application of analytical techniques and technologies as well as the core elements of a public safety/criminal justice education.",
    "requiredIelts": {},
    "requirements": "ntario Secondary School Diploma (OSSD) or equivalent, including six Grade 12 U or M courses with a minimum overall average of 65%, or a mature applicant (21 years or older). Required courses with minimum final grade of  65% in each: English: Grade 12 ENG4U"
  },
  {
    "name": "Police Foundations ",
    "campus": "King",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,721",
    "url": "https://www.senecacollege.ca/programs/fulltime/LAW.html",
    "duration": "4 Semesters (Fall start - 24 months, Winter start - 16 months)",
    "phone": "(416)-493-4144",
    "description": "Prepare for an exciting career in law enforcement and crime prevention. In this two-year diploma program, you will gain a comprehensive education combining professional knowledge with practical skills development. This program prepares you for careers in public safety, policing, investigations, security and enforcement services in public and private organizations, and corrections.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course"
  },
  {
    "name": "Academic Upgrading",
    "campus": "Yorkgate",
    "email": "admissions@senecacollege.ca",
    "tuition": "$0",
    "url": "https://www.senecacollege.ca/programs/fulltime/AUC.html#pre-content_menu",
    "duration": "1 to 3 Semesters",
    "phone": "(416)-493-4144",
    "description": "The two- to three-semester Academic Upgrading program is for those who are missing requirements for a college certificate or diploma program. Upon completion, you may be ready to apply to a college-level program or enter into an apprenticeship. The program offers you daytime or evening classes. You will work in single or multilevel courses, and benefit from the career counselling and assistance with college applications that you receive.",
    "requiredIelts": {},
    "requirements": "Applicants must be at least 19 years of age or mature early school leavers. All applicants are tested and interviewed in order to determine program suitability and student entry-level. "
  },
  {
    "name": "Arts and Science - University Transfer",
    "campus": "Seneca@York",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,573",
    "url": "https://www.senecacollege.ca/programs/fulltime/ASU.html",
    "duration": "4 Semesters (2 Years)",
    "phone": "(416)-493-4144",
    "description": "This two-year diploma program enables you to pursue a university education in the sciences and complete a diploma and a university degree in as little as four years at the University of Toronto Scarborough, York University, or Trent University. Courses include Math, Chemistry, Biology, Physics, and a range of Humanities and Social Sciences.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD) or equivalent with: Grade 12 English: ENG4(C) or ENG4(U). Grade 12 Mathematics: (C) or (U) or Grade 11 Mathematics: (U) or (M)"
  },
  {
    "name": "College Opportunities",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,690",
    "url": "https://www.senecacollege.ca/programs/fulltime/CAP.html",
    "duration": "2 Semesters (1 Year)",
    "phone": "(416)-493-4144",
    "description": "This two-semester certificate program is designed to provide you with strategies and skills to overcome barriers to further education and employment. Your studies will cover core academics, subjects on personal management, learning skills and entrepreneurship. This program offers you comprehensive support, academic advisement and career exploration opportunities including an 84-hour field placement.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD) or equivalent; OR Mature Student Status (age 19 or older)"
  },
  {
    "name": "General Arts - English for Academic Purposes",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,690",
    "url": "https://www.senecacollege.ca/programs/fulltime/GEA.html",
    "duration": "2 Semesters (8 Months)",
    "phone": "(416)-493-4144",
    "description": "This eight-month certificate program will help you improve your English skills. Your learning will be enhanced by courses in writing, reading, speaking and listening. In this program, you will use technology to help you with your coursework. Upon graduation, you may enter into a diploma program at Seneca or enter the workforce.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. Must be able to understand English at a preparatory level"
  },
  {
    "name": "General Arts - One Year Certificate",
    "campus": "King, Newnham, Seneca@York",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,721",
    "url": "https://www.senecacollege.ca/programs/fulltime/GAP.html",
    "duration": "2 Semesters (1 Year)",
    "phone": "(416)-493-4144",
    "description": "This one-year certificate program provides general education and the opportunity to explore and earn credit towards other college programs. A career-counselling component will help you choose and prepare for career-specific postsecondary education.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course"
  },
  {
    "name": "Honours Bachelor of Interdisciplinary Studies",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$6,665",
    "url": "https://www.senecacollege.ca/programs/fulltime/INS.html",
    "duration": "8 Semesters (4 Years)",
    "phone": "(416)-493-4144",
    "description": "Seneca’s Honours Bachelor of Interdisciplinary Studies is a customized degree that provides you with the liberal arts education to complement your diploma and advance your career or educational prospects. Complete your degree credential in two to two-and-a-half years, and gain practical experience through the work term. To find out more and to start mapping out your custom degree, please contact us",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD) or equivalent, including six Grade 12 U or M courses with a minimum overall average of 65%, or a mature applicant (21 years or older). Required courses with minimum final grade of  65% in each: English: Grade 12 ENG4U. Mathematic: any Grade 12 U"
  },
  {
    "name": "Liberal Arts University Transfer",
    "campus": "Newnham, Seneca@York",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,690",
    "url": "https://www.senecacollege.ca/programs/fulltime/LAT.html",
    "duration": "4 Semesters (2 Years)",
    "phone": "(416)-493-4144",
    "description": "This two-year diploma program enables you to pursue a university education to complete a diploma and a university degree in as little as four years at the University of Toronto (St. George or Scarborough), York University or Trent University. Courses include a variety of humanities and social science disciplines and focus on developing university-level skills.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course"
  },
  {
    "name": "Government Relations ",
    "campus": "Seneca@York",
    "email": "admissions@senecacollege.ca",
    "tuition": "$5,633",
    "url": "https://www.senecacollege.ca/programs/fulltime/GRM.html",
    "duration": "2 Semesters (1 Year)",
    "phone": "(416)-493-4144",
    "description": "Endorsed by the Public Affairs Association of Canada and the Government Relations Institute of Canada, this eight-month graduate certificate program features specialized practical government relations training that will prepare you for careers in government relations.",
    "requiredIelts": {},
    "requirements": "Ontario university or college degree or three-year college diploma or equivalent. Statement of interest and resumé. Writing test. English proficiency for graduate certificates "
  },
  {
    "name": "Public Relations - Corporate Communications",
    "campus": "Seneca@York",
    "email": "admissions@senecacollege.ca",
    "tuition": "$5,633",
    "url": "https://www.senecacollege.ca/programs/fulltime/PRC.html",
    "duration": "2 Semesters (1 Year)",
    "phone": "(416)-493-4144",
    "description": "This eight-month graduate certificate program will immerse you in public relations and corporate communications theory and practice. You will learn to write news releases, work with the media, research and develop strategic communications programs, hone digital communications skills and work in teams. You will be mentored by highly experienced teachers and learn how to effectively pursue a career in the public relations and communications industry. In this program, you will collaborate with exchange students from Europe. You will have access to one of the best public relations and corporate communications libraries available and develop transferable skills valuable in a rapidly changing economy. ",
    "requiredIelts": {},
    "requirements": "Ontario university or college degree or three-year college diploma or equivalent. Statement of interest and resumé. Writing test. English proficiency for graduate certificates "
  },
  {
    "name": "Technical Communication",
    "campus": "Seneca@York",
    "email": "admissions@senecacollege.ca",
    "tuition": "$5,633",
    "url": "https://www.senecacollege.ca/programs/fulltime/TEC.html",
    "duration": "2 Semesters (1 Year)",
    "phone": "(416)-493-4144",
    "description": "This one-year graduate certificate program offers practical experience for a career in technical, scientific, and computer-related communication. Today’s technical communicators are professionals who create technical content, develop user assistance, design websites, design and deliver corporate training, explain computers and technology to users, create multimedia materials, and develop support systems for consumer products. You will learn technical writing and editing, graphic and web design, user experience, content strategy, and instructional design. Courses cover the skills necessary to adapt to emerging technologies and launch your career as a professional immediately upon completing the program. You will gain hands-on experience through optional work placement under an employer committed to helping you meet your learning goals.",
    "requiredIelts": {},
    "requirements": "Ontario university or college degree or three-year college diploma or equivalent. Statement of interest and resumé. Writing test. English proficiency for graduate certificates "
  },
  {
    "name": "Broadcasting - Radio",
    "campus": "Seneca@York",
    "email": "admissions@senecacollege.ca",
    "tuition": "$4,212",
    "url": "https://www.senecacollege.ca/programs/fulltime/RTVR.html",
    "duration": "4 Semesters (2 Years)",
    "phone": "(416)-493-4144",
    "description": "In this two-year Broadcasting – Radio diploma program, you will experience engaging, hands-on learning that focuses on the principles of on-air presentation, script-writing and audio production. Your interest in radio broadcasting will blend well with the pre-professional training that you will receive in radio production and presentation.   ",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course. Online applicant profile and writing sample"
  },
  {
    "name": "Broadcasting - Television",
    "campus": "Seneca@York",
    "email": "admissions@senecacollege.ca",
    "tuition": "$5,364",
    "url": "https://www.senecacollege.ca/programs/fulltime/RTVT.html",
    "duration": "4 Semesters (2 Years)",
    "phone": "(416)-493-4144",
    "description": "In this two-year diploma program, you will learn about concepts, audio and video production and how to produce creative and engaging video content from script writing through to a final audio mix and everything in between. The hands-on experience offered by expert professionals, combined with your interest in video production, will enable you to become proficient in creating professional content for a variety of different platforms.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course. Online applicant profile and writing sample"
  },
  {
    "name": "Documentary and Non-Fiction Media Production",
    "campus": "Seneca@York",
    "email": "admissions@senecacollege.ca",
    "tuition": "$11,428",
    "url": "https://www.senecacollege.ca/programs/fulltime/DNM.html",
    "duration": "2 Semesters (8 Months)",
    "phone": "(416)-493-4144",
    "description": "In this one-year graduate certificate program, you will learn from a team of award-winning filmmakers and industry professionals and be immersed in rigorous, intensive, hands-on training in the art and craft of documentary filmmaking. Built on three pillars — creative, technical, industry — you will learn every aspect of documentary production, from story idea to pitching, shooting and editing, and market and distribution. As a graduate of this program, you will be engaged in pre-production (research and development,) production (principal photography,) and post-production (editing) as you wear multiple hats as a director, producer, cinematographer and editor to make your first documentary film.",
    "requiredIelts": {},
    "requirements": "Ontario university or college degree or college diploma or equivalent. Meeting with program co-ordinator. English proficiency for graduate certificates "
  },
  {
    "name": "Event and Media Production",
    "campus": "Seneca@York",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,968",
    "url": "https://www.senecacollege.ca/programs/fulltime/EMP.html",
    "duration": "4 Semesters (2 Years)",
    "phone": "(416)-493-4144",
    "description": "This two-year diploma immerses you in the fast-paced field of live events. From meetings to conferences, fundraisers, trade shows and entertainment and sporting events, you’ll be taught how to plan and execute a wide range of live events. This includes producing content such as interactive presentations, videos, audio and multi-screen mixed media. You will also learn how to scout venues and create floor plans plus set up, operate and tear down the gear behind successful events.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course. Online applicant profile and writing sample"
  },
  {
    "name": "Journalism",
    "campus": "Seneca@York",
    "email": "admissions@senecacollege.ca",
    "tuition": "$5,095",
    "url": "https://www.senecacollege.ca/programs/fulltime/JRN.html",
    "duration": "4 Semesters (2 Years)",
    "phone": "(416)-493-4144",
    "description": "Seneca’s two-year diploma Journalism program will provide you with hands-on training for multiple platforms — broadcast, video, audio, multimedia, online and social media. You will work in integrated newsrooms across all platforms. Starting on your first day, you will be in the field reporting and giving a voice to issues that matter. As the program develops you can specialize in sports, entertainment, aboriginal/environmental issues, investigative journalism, hosting/anchoring or documentary/multimedia presentations.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course. Online applicant profile and writing sample"
  },
  {
    "name": "Photography",
    "campus": "Seneca@York",
    "email": "admissions@senecacollege.ca",
    "tuition": "$4,640",
    "url": "https://www.senecacollege.ca/programs/fulltime/PHO.html",
    "duration": "4 Semesters (2 Years)",
    "phone": "(416)-493-4144",
    "description": "This two-year diploma program will grow your knowledge and interest in photography and image creation. You will experience hands-on learning focused on the technical skills, business knowledge and creative portfolio images needed to compete and succeed in this dynamic, constantly evolving profession.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course. Online applicant profile and questionnaire. Electronic photography portfolio"
  },
  {
    "name": "Biotechnology - Advanced",
    "campus": "Seneca@York",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,573",
    "url": "https://www.senecacollege.ca/programs/fulltime/BTA.html",
    "duration": "6 Semesters (3 Years)",
    "phone": "(416)-493-4144",
    "description": "In this three-year advanced diploma program, you will prepare for work as a research technologist in the life sciences field. You will study a range of topics, including molecular genetics, immunology, tissue culture, virology, biochemical techniques, histology, cell biology, biochemistry, computers, statistics and a common first year of basic biology, chemistry and mathematics. This program offers you theoretical knowledge of scientific methods and practical experience in performing precise experiments for research and development.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant.English: Grade 12 C or U, or equivalent course. Mathematics: Grade 12 C or U, or Grade 11 Functions (MCR3U), or equivalent course. Biology: Grade 11 C or U, or equivalent course. Chemistry: Grade 12 C or U, or equivalent course"
  },
  {
    "name": "Cannabis Regulation and Quality Assurance",
    "campus": "Seneca@York",
    "email": "admissions@senecacollege.ca",
    "tuition": "$6,022",
    "url": "https://www.senecacollege.ca/programs/fulltime/CAQC.html",
    "duration": "2 Semesters (1 Year)",
    "phone": "(416)-493-4144",
    "description": "This one-year graduate certificate program is the first of its kind in Ontario. With the increase in cannabis product commercialization, there has been a growing demand for regulation and quality assurance experts. In this program, you will develop the knowledge and expertise to grade and maintain product quality in a highly regulated industry. Your learning will include interpreting and understanding regulatory standards governed by the Access to Cannabis for Medical Regulations. Upon successful completion of this program, you will be prepared to seek careers in cannabis regulation or quality assurance in medical or cannabis production organizations.",
    "requiredIelts": {},
    "requirements": "Ontario university or college Bachelor of Science degree or equivalent in horticulture, food science, agricultural sciences, plant sciences, biology, chemistry or a related discipline. English proficiency for graduate certificates "
  },
  {
    "name": "Chemical Laboratory Technician",
    "campus": "Seneca@York",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,573",
    "url": "https://www.senecacollege.ca/programs/fulltime/CLT.html",
    "duration": "4 Semesters (2 Years)",
    "phone": "(416)-493-4144",
    "description": "In this two-year diploma program, you will benefit from practical training and learn the essential principles and techniques used in the biochemical sciences. You will gain hands-on experience needed to perform experiments and determinations with the precision required in a broad range of industries. That means getting hands-on training in the proper care and use of laboratory apparatus for wet and instrumental methods.  The program covers a broad range of topics, including organic and analytical chemistry, biochemistry, industrial microbiology, as well as pharmaceutical and instrumental methods.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course. Mathematics: Grade 12 C or U, or Grade 11 Functions (MCR3U), or equivalent course. Biology: Grade 11 C or U, or equivalent course. Chemistry: Grade 12 C or Grade 11 U, or equivalent course"
  },
  {
    "name": "Chemical Laboratory Technology - Pharmaceutical",
    "campus": "Seneca@York",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,573",
    "url": "https://www.senecacollege.ca/programs/fulltime/CLP.html",
    "duration": "6 Semesters (3 Years)",
    "phone": "(416)-493-4144",
    "description": "In this hands-on three-year advanced diploma program, you will focus on pharmaceutical analysis, product formulation and manufacturing, chemical instrumentation, biochemistry, microbiology and toxicology. You will receive the experience needed to perform experiments, manufacture tablets, ointments and creams with the precision required to meet pharmaceutical standards.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course. Mathematics: Grade 12 C or U, or Grade 11 Functions (MCR3U), or equivalent course. Biology: Grade 11 C or U, or equivalent course. Chemistry: Grade 12 C or U, or equivalent course"
  },
  {
    "name": "Clinical Research",
    "campus": "Seneca@York",
    "email": "admissions@senecacollege.ca",
    "tuition": "$6,815",
    "url": "https://www.senecacollege.ca/programs/fulltime/CRQC.html",
    "duration": "2 Semesters (1 Year)",
    "phone": "(416)-493-4144",
    "description": "This one-year certificate program, you will learn research design concepts, analysis and the quality assurance required for daily operations in the clinical research field. You will examine clinical studies across the pharmaceutical, medical device and natural health product sectors that give the competitive edge required in this dynamic industry. In this hands-on program, you will work alongside industry professionals and develop a network of contacts ahead of graduation.",
    "requiredIelts": {},
    "requirements": "Ontario university or college degree or equivalent in life sciences, nursing or a closely related field of study. Postsecondary studies must include physical sciences courses such as chemistry and biology. English proficiency for graduate certificates. Applicant profile "
  },
  {
    "name": "Cosmetic Science",
    "campus": "Seneca@York",
    "email": "admissions@senecacollege.ca",
    "tuition": "$6,705",
    "url": "https://www.senecacollege.ca/programs/fulltime/CSPC.html",
    "duration": "2 Semesters (1 Year)",
    "phone": "(416)-493-4144",
    "description": "This laboratory-based one-year graduate certificate program combines art, science and business principals for the development of cosmetic products. This program provides an optional work term(s) after completion of your first academic semester. This program emphasizes chemistry concepts and strategies from raw materials to finished products. Key topics include product development process, global regulations/challenges, biological systems, sales and marketing. It is the only graduate certificate program of its kind in Ontario and focuses on product formulation, cosmetic production and the industry's evolving regulatory industry.",
    "requiredIelts": {},
    "requirements": "Ontario university or college degree or three-year college diploma or equivalent in biochemistry, pharmacy, chemistry, biotechnology, chemical engineering, pharmaceutical manufacturing or a related field of study. English proficiency for graduate certificates "
  },
  {
    "name": "Pharmaceutical Regulatory Affairs and Quality Operations",
    "campus": "Seneca@York",
    "email": "admissions@senecacollege.ca",
    "tuition": "$6,022",
    "url": "https://www.senecacollege.ca/programs/fulltime/RAQC.html",
    "duration": "2 Semesters (1 Year)",
    "phone": "(416)-493-4144",
    "description": "Focus your career by specializing in this one-year graduate certificate program. You will gain a fundamental understanding of regulatory affairs and quality operations. Studies of regulatory compliance in Canada and internationally will prepare you for a career involving drug or medical regulations and quality assurance functions and roles. During the first semester, you will learn the fundamentals of regulatory affairs and quality operations. Your second semester will focus on more detailed exposure to the areas of regulation and quality operations. This program offers an optional work term(s), similar to the length to an academic semester, if you meet all the academic requirements.",
    "requiredIelts": {},
    "requirements": "Ontario university or college degree or equivalent in science with a focus on chemistry, biology or pharmaceutical. English proficiency for graduate certificates . Applicant profile "
  },
  {
    "name": "Environmental Landscape Management",
    "campus": "King",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,721",
    "url": "https://www.senecacollege.ca/programs/fulltime/EVL.html",
    "duration": "4 Semesters (2 Years)",
    "phone": "(416)-493-4144",
    "description": "Seneca's King Campus is part of a provincially significant wetland complex and is a valued source of headwaters to the Humber Rivers watershed, which is part of the Canadian Heritage Rivers System. In this unique two-year diploma program, the majority of your outdoor training will take place on this land. You will study ecology, traditional types of landscaping, practical skills and receive an overview of the ecosystem allowing you to understand the impact humans have on the environment and how to protect and restore its natural landscapes. The demand for environmental landscape management is growing within private and public organizations, therefore employers are in search of graduates who are committed, skilled and knowledgeable in the profession.",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course"
  },
  {
    "name": "Environmental Technician",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,690",
    "url": "https://www.senecacollege.ca/programs/fulltime/ETM.html",
    "duration": "4 Semesters (2 Years)",
    "phone": "(416)-493-4144",
    "description": "In this two-year diploma program, you will learn about environmental technology, water resources and applied sciences to gain the problem-solving skills needed for success in the environmental sector.  As a graduate you will be training to work as an environmental technician within traditional and environmental engineering industries. ",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course. Mathematics: Grade 12 C or U, or Grade 11 Functions (MCR3U), or equivalent course"
  },
  {
    "name": "Environmental Technology",
    "campus": "Newnham",
    "email": "admissions@senecacollege.ca",
    "tuition": "$3,690",
    "url": "https://www.senecacollege.ca/programs/fulltime/EMT.html",
    "duration": "6 Semesters (3 Years)",
    "phone": "(416)-493-4144",
    "description": "In this three-year advanced diploma program, you will build a career where urban and human needs meet to share the earth’s resources. You will focus on environmental technology, water resources and applied sciences. In your final two semesters, you will benefit from advanced computer modelling, water management and analytical courses. You will also develop problem-solving and communication skills needed to succeed in the environmental sector. ",
    "requiredIelts": {},
    "requirements": "Ontario Secondary School Diploma (OSSD), or equivalent, or a mature applicant. English: Grade 12 C or U, or equivalent course. Mathematics: Grade 12 C or U, or Grade 11 Functions (MCR3U), or equivalent course"
  }
]
